<?php 

$locations = array (
		2280000 => array (
				'country' => '土耳其',
				'provinces' => array (
						2283100 => array (
								'province' => '凡' 
						),
						2285200 => array (
								'province' => '內夫謝希爾' 
						),
						2282700 => array (
								'province' => '巴伊布林特' 
						),
						2282600 => array (
								'province' => '巴特曼' 
						),
						2282400 => array (
								'province' => '巴勒克埃西爾' 
						),
						2282000 => array (
								'province' => '巴爾騰' 
						),
						2282500 => array (
								'province' => '比特利斯' 
						),
						2282300 => array (
								'province' => '比萊吉克' 
						),
						2285100 => array (
								'province' => '尼代' 
						),
						2281800 => array (
								'province' => '布林杜爾' 
						),
						2281900 => array (
								'province' => '布爾薩' 
						),
						2280100 => array (
								'province' => '艾登' 
						),
						2283400 => array (
								'province' => '加濟安泰普' 
						),
						2282900 => array (
								'province' => '代尼茲利' 
						),
						2285500 => array (
								'province' => '卡拉比克' 
						),
						2285700 => array (
								'province' => '卡拉曼' 
						),
						2285900 => array (
								'province' => '卡斯塔莫努' 
						),
						2285400 => array (
								'province' => '卡赫拉曼馬拉什' 
						),
						2285300 => array (
								'province' => '卡爾斯' 
						),
						2283500 => array (
								'province' => '吉雷松' 
						),
						2286600 => array (
								'province' => '托卡特' 
						),
						2287300 => array (
								'province' => '伊切爾' 
						),
						2287200 => array (
								'province' => '伊迪爾' 
						),
						2287700 => array (
								'province' => '伊茲密爾' 
						),
						2287400 => array (
								'province' => '伊斯帕爾塔' 
						),
						2287500 => array (
								'province' => '伊斯坦布爾' 
						),
						2281500 => array (
								'province' => '安卡拉' 
						),
						2281700 => array (
								'province' => '安塔利亞' 
						),
						2284100 => array (
								'province' => '克勒克卡萊' 
						),
						2283800 => array (
								'province' => '克爾謝希爾' 
						),
						2281100 => array (
								'province' => '阿克薩賴' 
						),
						2281400 => array (
								'province' => '阿馬西亞' 
						),
						2281200 => array (
								'province' => '阿勒' 
						),
						2281000 => array (
								'province' => '阿菲永' 
						),
						2280300 => array (
								'province' => '阿達納' 
						),
						2280800 => array (
								'province' => '阿爾特溫' 
						),
						2280600 => array (
								'province' => '阿爾達罕' 
						),
						2280400 => array (
								'province' => '阿德亞曼' 
						),
						2283700 => array (
								'province' => '居米什哈內' 
						),
						2286000 => array (
								'province' => '屈塔希亞' 
						),
						2282800 => array (
								'province' => '昌克勒' 
						),
						2284400 => array (
								'province' => '拉飛' 
						),
						2287800 => array (
								'province' => '宗古爾達克' 
						),
						2283000 => array (
								'province' => '迪亞巴克爾' 
						),
						2285800 => array (
								'province' => '恰納卡萊' 
						),
						2283200 => array (
								'province' => '哈卡裏' 
						),
						2283300 => array (
								'province' => '哈塔伊' 
						),
						2287600 => array (
								'province' => '約茲加特' 
						),
						2284200 => array (
								'province' => '科尼亞' 
						),
						2283900 => array (
								'province' => '科賈埃利' 
						),
						2284000 => array (
								'province' => '柯克拉雷利' 
						),
						2286400 => array (
								'province' => '通傑利' 
						),
						2286700 => array (
								'province' => '烏薩克' 
						),
						2286300 => array (
								'province' => '泰基爾達' 
						),
						2284900 => array (
								'province' => '馬尼薩' 
						),
						2284800 => array (
								'province' => '馬拉蒂亞' 
						),
						2284600 => array (
								'province' => '馬爾丁' 
						),
						2286500 => array (
								'province' => '特拉布宗' 
						),
						2281300 => array (
								'province' => '埃拉澤' 
						),
						2280200 => array (
								'province' => '埃迪爾內' 
						),
						2281600 => array (
								'province' => '埃斯基謝希爾' 
						),
						2280700 => array (
								'province' => '埃爾津詹' 
						),
						2280900 => array (
								'province' => '埃爾祖魯姆' 
						),
						2283600 => array (
								'province' => '基利斯' 
						),
						2284300 => array (
								'province' => '開塞利' 
						),
						2285600 => array (
								'province' => '喬魯姆' 
						),
						2282200 => array (
								'province' => '博盧' 
						),
						2284500 => array (
								'province' => '裏澤' 
						),
						2282100 => array (
								'province' => '賓格爾' 
						),
						2280500 => array (
								'province' => '奧爾杜' 
						),
						2286200 => array (
								'province' => '薩卡裏亞' 
						),
						2286100 => array (
								'province' => '薩姆松' 
						),
						2285000 => array (
								'province' => '穆什' 
						),
						2284700 => array (
								'province' => '穆拉' 
						),
						2287100 => array (
								'province' => '錫瓦斯' 
						),
						2286800 => array (
								'province' => '錫爾納克' 
						),
						2286900 => array (
								'province' => '錫爾特' 
						),
						2287000 => array (
								'province' => '錫諾普' 
						) 
				) 
		),
		2390000 => array (
				'country' => '瓦努阿圖' 
		),
		2370000 => array (
				'country' => '文莱' 
		),
		2100000 => array (
				'country' => '日本',
				'provinces' => array (
						2103800 => array (
								'province' => '山口' 
						),
						2104100 => array (
								'province' => '山形' 
						),
						2103900 => array (
								'province' => '山梨' 
						),
						2101200 => array (
								'province' => '大分' 
						),
						2101000 => array (
								'province' => '大阪' 
						),
						2103600 => array (
								'province' => '三重' 
						),
						2103500 => array (
								'province' => '千葉' 
						),
						2100300 => array (
								'province' => '北海道' 
						),
						2103700 => array (
								'province' => '石川' 
						),
						2103000 => array (
								'province' => '岐阜' 
						),
						2100800 => array (
								'province' => '沖繩' 
						),
						2100400 => array (
								'province' => '兵庫' 
						),
						2104700 => array (
								'province' => '佐賀' 
						),
						2102300 => array (
								'province' => '和歌山' 
						),
						2102100 => array (
								'province' => '岡山' 
						),
						2104500 => array (
								'province' => '岩手' 
						),
						2102800 => array (
								'province' => '奈良' 
						),
						2100700 => array (
								'province' => '長崎' 
						),
						2100900 => array (
								'province' => '長野' 
						),
						2102400 => array (
								'province' => '京都' 
						),
						2103200 => array (
								'province' => '青森' 
						),
						2101400 => array (
								'province' => '東京' 
						),
						2104000 => array (
								'province' => '神奈川' 
						),
						2104300 => array (
								'province' => '香川' 
						),
						2103300 => array (
								'province' => '秋田' 
						),
						2100600 => array (
								'province' => '茨城' 
						),
						2101300 => array (
								'province' => '島根' 
						),
						2102200 => array (
								'province' => '高知' 
						),
						2100500 => array (
								'province' => '宮城' 
						),
						2102000 => array (
								'province' => '宮崎' 
						),
						2102900 => array (
								'province' => '鳥取' 
						),
						2102600 => array (
								'province' => '鹿兒島' 
						),
						2103400 => array (
								'province' => '埼玉' 
						),
						2104600 => array (
								'province' => '滋賀' 
						),
						2101800 => array (
								'province' => '富山' 
						),
						2100200 => array (
								'province' => '愛知' 
						),
						2100100 => array (
								'province' => '愛媛' 
						),
						2101700 => array (
								'province' => '福井' 
						),
						2101600 => array (
								'province' => '福岡' 
						),
						2101500 => array (
								'province' => '福島' 
						),
						2104400 => array (
								'province' => '新潟' 
						),
						2103100 => array (
								'province' => '群馬' 
						),
						2104200 => array (
								'province' => '熊本' 
						),
						2101900 => array (
								'province' => '廣島' 
						),
						2101100 => array (
								'province' => '徳島' 
						),
						2102500 => array (
								'province' => '靜岡' 
						),
						2102700 => array (
								'province' => '櫪木' 
						) 
				) 
		),
		1150000 => array (
				'country' => '巴巴多斯島' 
		),
		1160000 => array (
				'country' => '巴布亞新磯內亞' 
		),
		1330000 => array (
				'country' => '巴西',
				'provinces' => array (
						1330700 => array (
								'province' => '巴西利亞' 
						),
						1330800 => array (
								'province' => '巴伊亞' 
						),
						1330500 => array (
								'province' => '巴拉那' 
						),
						1330900 => array (
								'province' => '戈阿斯' 
						),
						1331800 => array (
								'province' => '皮奧伊' 
						),
						1330400 => array (
								'province' => '北裏奧格蘭德' 
						),
						1331400 => array (
								'province' => '米納斯吉拉斯' 
						),
						1332600 => array (
								'province' => '托坎廷斯' 
						),
						1331200 => array (
								'province' => '里約熱內盧' 
						),
						1330100 => array (
								'province' => '阿克裏' 
						),
						1330200 => array (
								'province' => '阿拉戈斯' 
						),
						1330300 => array (
								'province' => '阿馬帕' 
						),
						1330600 => array (
								'province' => '伯南布哥' 
						),
						1331900 => array (
								'province' => '帕拉' 
						),
						1332000 => array (
								'province' => '帕拉伊巴' 
						),
						1332700 => array (
								'province' => '亞馬孫' 
						),
						1331700 => array (
								'province' => '南馬托格羅索' 
						),
						1331600 => array (
								'province' => '南裏奧格蘭德' 
						),
						1331500 => array (
								'province' => '馬托格羅索' 
						),
						1331300 => array (
								'province' => '馬拉尼昂' 
						),
						1331000 => array (
								'province' => '朗多尼亞' 
						),
						1332500 => array (
								'province' => '聖卡塔琳娜' 
						),
						1332300 => array (
								'province' => '聖保羅' 
						),
						1332200 => array (
								'province' => '聖埃斯皮裏圖' 
						),
						1332100 => array (
								'province' => '塞阿拉' 
						),
						1332400 => array (
								'province' => '塞爾希培' 
						),
						1331100 => array (
								'province' => '羅賴馬' 
						) 
				) 
		),
		1240000 => array (
				'country' => '巴林' 
		),
		1210000 => array (
				'country' => '巴哈馬' 
		),
		1320000 => array (
				'country' => '巴拿馬' 
		),
		1230000 => array (
				'country' => '巴基斯坦' 
		),
		1190000 => array (
				'country' => '不丹' 
		),
		2620000 => array (
				'country' => '中非共和國' 
		),
		2630000 => array (
				'country' => '中國',
				'provinces' => array (
						2632700 => array (
								'province' => '山西',
								'citys' => array (
										2632702 => '大同',
										2632708 => '太原',
										2632706 => '呂梁',
										2632709 => '忻州',
										2632701 => '長治',
										2632704 => '晉中',
										2632703 => '晉城',
										2632707 => '朔州',
										2632711 => '陽泉',
										2632710 => '運城',
										2632705 => '臨汾' 
								) 
						),
						2632400 => array (
								'province' => '山東',
								'citys' => array (
										2632411 => '日照',
										2632410 => '青島',
										2632402 => '東營',
										2632414 => '威海',
										2632412 => '泰安',
										2632408 => '萊蕪',
										2632407 => '聊城',
										2632416 => '淄博',
										2632404 => '菏澤',
										2632417 => '棗莊',
										2632415 => '煙臺',
										2632403 => '德州',
										2632409 => '臨沂',
										2632405 => '濟南',
										2632406 => '濟寧',
										2632413 => '濰坊',
										2632401 => '濱州' 
								) 
						),
						2632500 => array (
								'province' => '上海',
								'citys' => array (
										2632504 => '奉賢',
										2632503 => '長寧',
										2632509 => '金山',
										2632514 => '青浦',
										2632515 => '松江',
										2632505 => '虹口',
										2632512 => '浦東新區',
										2632516 => '徐匯',
										2632502 => '崇明',
										2632506 => '黃浦',
										2632511 => '閔行',
										2632513 => '普陀',
										2632517 => '楊浦',
										2632518 => '閘北',
										2632508 => '嘉定',
										2632510 => '盧灣',
										2632507 => '靜安',
										2632501 => '寶山' 
								) 
						),
						2632800 => array (
								'province' => '天津',
								'citys' => array (
										2632801 => '北辰',
										2632816 => '西青',
										2632807 => '和平',
										2632805 => '河北',
										2632809 => '河西',
										2632806 => '河東',
										2632815 => '武清',
										2632804 => '東麗',
										2632808 => '紅橋',
										2632811 => '津南',
										2632814 => '南開',
										2632813 => '寧河',
										2632812 => '薊縣',
										2632810 => '靜海',
										2632803 => '濱海新區',
										2632802 => '寶坻' 
								) 
						),
						2632000 => array (
								'province' => '內蒙古',
								'citys' => array (
										2632003 => '巴彥淖爾',
										2632002 => '包頭',
										2632004 => '赤峰',
										2632001 => '阿拉善',
										2632006 => '呼和浩特',
										2632007 => '呼倫貝爾',
										2632008 => '通遼',
										2632009 => '烏海',
										2632010 => '烏蘭察布',
										2632005 => '鄂爾多斯',
										2632011 => '興安',
										2632012 => '錫林郭勒' 
								) 
						),
						2630700 => array (
								'province' => '甘肅',
								'citys' => array (
										2630712 => '天水',
										2630703 => '甘南',
										2630710 => '平涼',
										2630701 => '白銀',
										2630704 => '金昌',
										2630713 => '武威',
										2630702 => '定西',
										2630705 => '酒泉',
										2630714 => '張掖',
										2630706 => '嘉峪關',
										2630711 => '慶陽',
										2630708 => '臨夏',
										2630707 => '隴南',
										2630709 => '蘭州市' 
								) 
						),
						2632300 => array (
								'province' => '四川',
								'citys' => array (
										2632315 => '內江',
										2632302 => '巴中',
										2632308 => '甘孜',
										2632320 => '自貢',
										2632303 => '成都',
										2632301 => '阿壩',
										2632319 => '宜賓',
										2632312 => '眉山',
										2632314 => '南充',
										2632309 => '涼山',
										2632317 => '遂寧',
										2632305 => '達州',
										2632318 => '雅安',
										2632321 => '資陽',
										2632313 => '綿陽',
										2632307 => '廣元',
										2632306 => '廣安',
										2632310 => '樂山',
										2632304 => '德陽',
										2632311 => '瀘州',
										2632316 => '攀枝花' 
								) 
						),
						2630300 => array (
								'province' => '北京',
								'citys' => array (
										2630304 => '大興',
										2630311 => '平谷',
										2630312 => '石景山',
										2630315 => '西城',
										2630316 => '延慶',
										2630309 => '門頭溝',
										2630301 => '昌平',
										2630305 => '房山',
										2630303 => '東城',
										2630314 => '通州',
										2630307 => '海澱',
										2630310 => '密雲',
										2630313 => '順義',
										2630302 => '朝陽',
										2630306 => '豐台',
										2630308 => '懷柔' 
								) 
						),
						2632900 => array (
								'province' => '台灣',
								'citys' => array (
										2632916 => '台中市',
										2632912 => '台北市',
										2632913 => '台東縣',
										2632914 => '台南市',
										2632902 => '花蓮縣',
										2632904 => '金門縣',
										2632908 => '苗栗縣',
										2632921 => '宜蘭縣',
										2632910 => '屏東縣',
										2632909 => '南投縣',
										2632907 => '連江縣',
										2632915 => '桃園縣',
										2632901 => '高雄市',
										2632903 => '基隆市',
										2632920 => '雲林縣',
										2632917 => '新北市',
										2632918 => '新竹市',
										2632919 => '新竹縣',
										2632905 => '嘉義市',
										2632906 => '嘉義縣',
										2632922 => '彰化縣',
										2632911 => '澎湖縣' 
								) 
						),
						2631600 => array (
								'province' => '吉林',
								'citys' => array (
										2631601 => '白城',
										2631606 => '四平',
										2631604 => '吉林',
										2631609 => '延邊',
										2631602 => '白山',
										2631603 => '長春',
										2631607 => '松原',
										2631608 => '通化',
										2631605 => '遼源' 
								) 
						),
						2631800 => array (
								'province' => '江西',
								'citys' => array (
										2631805 => '九江',
										2631808 => '上饒',
										2631803 => '吉安',
										2631810 => '宜春',
										2631806 => '南昌',
										2631807 => '萍鄉',
										2631804 => '景德鎮',
										2631809 => '新餘',
										2631801 => '撫州',
										2631802 => '贛州',
										2631811 => '鷹潭' 
								) 
						),
						2631700 => array (
								'province' => '江蘇',
								'citys' => array (
										2631704 => '南京',
										2631705 => '南通',
										2631703 => '連雲港',
										2631708 => '泰州',
										2631710 => '徐州',
										2631702 => '淮安',
										2631701 => '常州',
										2631706 => '宿遷',
										2631709 => '無錫',
										2631712 => '揚州',
										2631713 => '鎮江',
										2631707 => '蘇州',
										2631711 => '鹽城' 
								) 
						),
						2633000 => array (
								'province' => '西藏',
								'citys' => array (
										2633007 => '山南',
										2633006 => '日喀則',
										2633005 => '那曲',
										2633001 => '阿裡',
										2633002 => '昌都',
										2633003 => '拉薩',
										2633004 => '林芝' 
								) 
						),
						2630100 => array (
								'province' => '安徽',
								'citys' => array (
										2630112 => '六安',
										2630109 => '合肥',
										2630105 => '池州',
										2630101 => '安慶',
										2630107 => '阜陽',
										2630117 => '宣城',
										2630113 => '馬鞍山',
										2630102 => '蚌埠',
										2630103 => '亳州',
										2630104 => '巢湖',
										2630108 => '淮北',
										2630110 => '淮南',
										2630111 => '黃山',
										2630114 => '宿州',
										2630106 => '滁州',
										2630115 => '銅陵',
										2630116 => '蕪湖' 
								) 
						),
						2631100 => array (
								'province' => '河北',
								'citys' => array (
										2631108 => '石家莊',
										2631110 => '邢臺',
										2631104 => '邯鄲',
										2631102 => '承德',
										2631101 => '保定',
										2631109 => '唐山',
										2631107 => '秦皇島',
										2631106 => '廊坊',
										2631111 => '張家口',
										2631103 => '滄州',
										2631105 => '衡水' 
								) 
						),
						2631400 => array (
								'province' => '河南',
								'citys' => array (
										2631411 => '三門峽',
										2631409 => '平頂山',
										2631401 => '安陽',
										2631416 => '周口',
										2631407 => '洛陽',
										2631408 => '南陽',
										2631415 => '信陽',
										2631412 => '商丘',
										2631413 => '許昌',
										2631404 => '焦作',
										2631405 => '開封',
										2631414 => '新鄉',
										2631418 => '鄭州',
										2631406 => '漯河',
										2631417 => '駐馬店',
										2631403 => '濟源',
										2631410 => '濮陽',
										2631402 => '鶴壁' 
								) 
						),
						2632200 => array (
								'province' => '青海',
								'citys' => array (
										2632208 => '玉樹',
										2632207 => '西寧',
										2632201 => '果洛',
										2632202 => '海北',
										2632206 => '海西',
										2632203 => '海東',
										2632205 => '海南',
										2632204 => '黃南' 
								) 
						),
						2633100 => array (
								'province' => '香港',
								'citys' => array (
										2633106 => '九龍城區',
										2633102 => '大埔區',
										2633113 => '屯門區',
										2633117 => '元朗區',
										2633118 => '中西區',
										2633101 => '北區',
										2633115 => '西貢區',
										2633112 => '沙田區',
										2633116 => '油尖旺區',
										2633103 => '東區',
										2633110 => '荃灣區',
										2633109 => '南區',
										2633111 => '深水埗區',
										2633105 => '黃大仙區',
										2633107 => '葵青區',
										2633108 => '離島區',
										2633104 => '觀塘區',
										2633114 => '灣仔區' 
								) 
						),
						2630400 => array (
								'province' => '重慶',
								'citys' => array (
										2630415 => '九龍坡',
										2630408 => '大足',
										2630406 => '大渡口',
										2630402 => '巴南',
										2630437 => '永川',
										2630401 => '北碚',
										2630427 => '石柱',
										2630412 => '合川',
										2630413 => '江北',
										2630414 => '江津',
										2630425 => '沙坪壩',
										2630439 => '酉陽',
										2630435 => '秀山',
										2630410 => '奉節',
										2630417 => '兩江新區',
										2630405 => '長壽',
										2630432 => '巫山',
										2630433 => '巫溪',
										2630430 => '武隆',
										2630441 => '忠縣',
										2630420 => '南川',
										2630419 => '南岸',
										2630404 => '城口',
										2630418 => '梁平',
										2630411 => '涪陵',
										2630434 => '萬州',
										2630431 => '萬盛',
										2630416 => '開縣',
										2630440 => '渝中',
										2630436 => '渝北',
										2630438 => '雲陽',
										2630421 => '彭水',
										2630407 => '墊江',
										2630422 => '綦江',
										2630424 => '榮昌',
										2630428 => '銅梁',
										2630429 => '潼南',
										2630423 => '黔江',
										2630409 => '豐都',
										2630403 => '璧山',
										2630426 => '雙橋' 
								) 
						),
						2632600 => array (
								'province' => '陝西',
								'citys' => array (
										2632607 => '西安',
										2632609 => '延安',
										2632601 => '安康',
										2632608 => '咸陽',
										2632604 => '商洛',
										2632606 => '渭南',
										2632610 => '榆林',
										2632605 => '銅川',
										2632603 => '漢中',
										2632602 => '寶雞' 
								) 
						),
						2633400 => array (
								'province' => '浙江',
								'citys' => array (
										2633409 => '台州',
										2633411 => '舟山',
										2633403 => '金華',
										2633402 => '杭州',
										2633408 => '紹興',
										2633401 => '湖州',
										2633410 => '溫州',
										2633404 => '嘉興',
										2633406 => '寧波',
										2633405 => '麗水',
										2633407 => '衢州' 
								) 
						),
						2631500 => array (
								'province' => '海南',
								'citys' => array (
										2631515 => '三亞',
										2631516 => '屯昌',
										2631517 => '文昌',
										2631521 => '中沙',
										2631519 => '五指山',
										2631501 => '白沙',
										2631520 => '西沙',
										2631503 => '昌江',
										2631506 => '東方',
										2631505 => '定安',
										2631512 => '南沙',
										2631502 => '保亭',
										2631508 => '海口',
										2631511 => '陵水',
										2631518 => '萬寧',
										2631507 => '儋州',
										2631509 => '樂東',
										2631504 => '澄邁',
										2631510 => '臨高',
										2631514 => '瓊中',
										2631513 => '瓊海' 
								) 
						),
						2630900 => array (
								'province' => '貴州',
								'citys' => array (
										2630904 => '六盤水',
										2630901 => '安順',
										2630902 => '畢節',
										2630903 => '貴陽',
										2630908 => '銅仁',
										2630909 => '遵義',
										2630907 => '黔西南',
										2630905 => '黔東南',
										2630906 => '黔南' 
								) 
						),
						2631000 => array (
								'province' => '湖北',
								'citys' => array (
										2631009 => '十堰',
										2631011 => '天門',
										2631015 => '仙桃',
										2631013 => '孝感',
										2631012 => '武漢',
										2631017 => '宜昌',
										2631014 => '咸寧',
										2631008 => '神農架',
										2631006 => '荊州',
										2631005 => '荊門',
										2631001 => '恩施',
										2631002 => '鄂州',
										2631004 => '黃石',
										2631003 => '黃岡',
										2631010 => '隨州',
										2631007 => '潛江',
										2631016 => '襄陽' 
								) 
						),
						2631300 => array (
								'province' => '湖南',
								'citys' => array (
										2631312 => '永州',
										2631307 => '邵陽',
										2631311 => '岳陽',
										2631302 => '長沙',
										2631314 => '株洲',
										2631303 => '郴州',
										2631310 => '益陽',
										2631301 => '常德',
										2631306 => '婁底',
										2631313 => '張家界',
										2631309 => '湘西',
										2631308 => '湘潭',
										2631305 => '衡陽',
										2631304 => '懷化' 
								) 
						),
						2631200 => array (
								'province' => '黑龍江',
								'citys' => array (
										2631210 => '七台河',
										2631201 => '大慶',
										2631202 => '大興安嶺',
										2631213 => '伊春',
										2631208 => '牡丹江',
										2631206 => '佳木斯',
										2631203 => '哈爾濱',
										2631205 => '黑河',
										2631211 => '綏化',
										2631209 => '齊齊哈爾',
										2631212 => '雙鴨山',
										2631207 => '雞西',
										2631204 => '鶴崗' 
								) 
						),
						2633300 => array (
								'province' => '雲南',
								'citys' => array (
										2633304 => '大理',
										2633313 => '文山',
										2633315 => '玉溪',
										2633314 => '西雙版納',
										2633312 => '曲靖',
										2633307 => '昆明',
										2633305 => '迪慶',
										2633310 => '怒江',
										2633306 => '紅河',
										2633316 => '昭通',
										2633301 => '保山',
										2633311 => '普洱',
										2633302 => '楚雄',
										2633303 => '德宏',
										2633308 => '臨滄',
										2633309 => '麗江' 
								) 
						),
						2630500 => array (
								'province' => '福建',
								'citys' => array (
										2630507 => '三明',
										2630506 => '泉州',
										2630504 => '南平',
										2630505 => '莆田',
										2630501 => '福州',
										2630508 => '廈門',
										2630509 => '漳州',
										2630503 => '寧德',
										2630502 => '龍岩' 
								) 
						),
						2633200 => array (
								'province' => '新疆',
								'citys' => array (
										2633205 => '巴音郭楞',
										2633216 => '五家渠',
										2633212 => '石河子',
										2633214 => '吐魯番',
										2633218 => '伊犁',
										2633211 => '克孜勒蘇',
										2633209 => '克拉瑪依',
										2633201 => '阿克蘇',
										2633202 => '阿拉爾',
										2633203 => '阿勒泰',
										2633208 => '和田',
										2633206 => '昌吉',
										2633207 => '哈密',
										2633217 => '烏魯木齊',
										2633213 => '塔城',
										2633210 => '喀什',
										2633204 => '博爾塔拉',
										2633215 => '圖木舒克' 
								) 
						),
						2630800 => array (
								'province' => '廣西',
								'citys' => array (
										2630801 => '北海',
										2630814 => '玉林',
										2630804 => '防城港',
										2630802 => '百色',
										2630807 => '河池',
										2630809 => '來賓',
										2630811 => '南寧',
										2630810 => '柳州',
										2630806 => '桂林',
										2630813 => '梧州',
										2630803 => '崇左',
										2630805 => '貴港',
										2630808 => '賀州',
										2630812 => '欽州' 
								) 
						),
						2630600 => array (
								'province' => '廣東',
								'citys' => array (
										2630621 => '中山',
										2630614 => '汕尾',
										2630613 => '汕頭',
										2630607 => '江門',
										2630603 => '佛山',
										2630605 => '河源',
										2630609 => '茂名',
										2630602 => '東莞',
										2630618 => '珠海',
										2630610 => '梅州',
										2630615 => '深圳',
										2630611 => '清遠',
										2630617 => '陽江',
										2630606 => '惠州',
										2630619 => '湛江',
										2630616 => '雲浮',
										2630608 => '揭陽',
										2630620 => '肇慶',
										2630604 => '廣州',
										2630612 => '韶關',
										2630601 => '潮州' 
								) 
						),
						2632100 => array (
								'province' => '寧夏',
								'citys' => array (
										2632105 => '中衛',
										2632102 => '石嘴山',
										2632103 => '吳忠',
										2632101 => '固原',
										2632104 => '銀川' 
								) 
						),
						2631900 => array (
								'province' => '遼寧',
								'citys' => array (
										2631905 => '大連',
										2631904 => '丹東',
										2631902 => '本溪',
										2631907 => '阜新',
										2631908 => '葫蘆島',
										2631903 => '朝陽',
										2631910 => '遼陽',
										2631906 => '撫順',
										2631911 => '盤錦',
										2631901 => '鞍山',
										2631914 => '營口',
										2631909 => '錦州',
										2631912 => '瀋陽',
										2631913 => '鐵嶺' 
								) 
						),
						2630200 => array (
								'province' => '澳門',
								'citys' => array (
										2630201 => '大堂區',
										2630202 => '氹仔',
										2630204 => '花地瑪堂區',
										2630203 => '風順堂區',
										2630207 => '望德堂區',
										2630206 => '聖安多尼堂區',
										2630205 => '路環島' 
								) 
						) 
				) 
		),
		1360000 => array (
				'country' => '丹麥' 
		),
		2560000 => array (
				'country' => '牙買加' 
		),
		1380000 => array (
				'country' => '厄瓜多爾' 
		),
		1400000 => array (
				'country' => '厄立特里亞' 
		),
		1270000 => array (
				'country' => '比利時' 
		),
		1910000 => array (
				'country' => '毛里求斯' 
		),
		2040000 => array (
				'country' => '尼日利亞' 
		),
		2020000 => array (
				'country' => '尼加拉瓜' 
		),
		2000000 => array (
				'country' => '尼泊爾' 
		),
		2340000 => array (
				'country' => '瓜地馬拉' 
		),
		1260000 => array (
				'country' => '布隆迪' 
		),
		1630000 => array (
				'country' => '加納' 
		),
		1640000 => array (
				'country' => '加拿大',
				'provinces' => array (
						1642300 => array (
								'province' => '三河鎮' 
						),
						1640400 => array (
								'province' => '巴里' 
						),
						1640500 => array (
								'province' => '布列塔尼角' 
						),
						1640700 => array (
								'province' => '弗雷德里頓' 
						),
						1641900 => array (
								'province' => '卡里加裏' 
						),
						1640600 => array (
								'province' => '多倫多' 
						),
						1643300 => array (
								'province' => '伊魁特' 
						),
						1640800 => array (
								'province' => '圭爾夫' 
						),
						1641700 => array (
								'province' => '里賈納' 
						),
						1640100 => array (
								'province' => '阿伯茨福' 
						),
						1643400 => array (
								'province' => '耶洛奈夫' 
						),
						1641400 => array (
								'province' => '金斯頓' 
						),
						1642000 => array (
								'province' => '舍布魯克' 
						),
						1640900 => array (
								'province' => '哈利法克斯' 
						),
						1641000 => array (
								'province' => '哈密爾頓' 
						),
						1641600 => array (
								'province' => '倫敦' 
						),
						1642100 => array (
								'province' => '桑德貝' 
						),
						1643200 => array (
								'province' => '夏洛特敦' 
						),
						1640200 => array (
								'province' => '埃德蒙頓' 
						),
						1641300 => array (
								'province' => '基奇納' 
						),
						1641200 => array (
								'province' => '基勞納' 
						),
						1643100 => array (
								'province' => '渥太華' 
						),
						1642400 => array (
								'province' => '聖卡塔琳娜' 
						),
						1642600 => array (
								'province' => '聖約翰斯' 
						),
						1641800 => array (
								'province' => '蒙特利爾' 
						),
						1642900 => array (
								'province' => '溫尼伯' 
						),
						1642800 => array (
								'province' => '溫哥華' 
						),
						1643000 => array (
								'province' => '溫莎' 
						),
						1641500 => array (
								'province' => '魁北克' 
						),
						1640300 => array (
								'province' => '奧沙瓦' 
						),
						1642700 => array (
								'province' => '維多利亞' 
						),
						1642500 => array (
								'province' => '薩斯卡通' 
						),
						1642200 => array (
								'province' => '薩德伯裏' 
						),
						1641100 => array (
								'province' => '懷特霍斯' 
						) 
				) 
		),
		2590000 => array (
				'country' => '以色列' 
		),
		1300000 => array (
				'country' => '北馬利安納群島' 
		),
		2080000 => array (
				'country' => '卡塔爾' 
		),
		1450000 => array (
				'country' => '古巴' 
		),
		2650000 => array (
				'country' => '台灣',
				'provinces' => array (
						2651600 => array (
								'province' => '台中市' 
						),
						2651200 => array (
								'province' => '台北市' 
						),
						2651300 => array (
								'province' => '台東縣' 
						),
						2651400 => array (
								'province' => '台南市' 
						),
						2650200 => array (
								'province' => '花蓮縣' 
						),
						2650400 => array (
								'province' => '金門縣' 
						),
						2650800 => array (
								'province' => '苗栗縣' 
						),
						2652100 => array (
								'province' => '宜蘭縣' 
						),
						2651000 => array (
								'province' => '屏東縣' 
						),
						2650900 => array (
								'province' => '南投縣' 
						),
						2650700 => array (
								'province' => '連江縣' 
						),
						2651500 => array (
								'province' => '桃園縣' 
						),
						2650100 => array (
								'province' => '高雄市' 
						),
						2650300 => array (
								'province' => '基隆市' 
						),
						2652000 => array (
								'province' => '雲林縣' 
						),
						2651700 => array (
								'province' => '新北市' 
						),
						2651800 => array (
								'province' => '新竹市' 
						),
						2651900 => array (
								'province' => '新竹縣' 
						),
						2650500 => array (
								'province' => '嘉義市' 
						),
						2650600 => array (
								'province' => '嘉義縣' 
						),
						2652200 => array (
								'province' => '彰化縣' 
						),
						2651100 => array (
								'province' => '澎湖縣' 
						) 
				) 
		),
		1800000 => array (
				'country' => '老撾' 
		),
		1590000 => array (
				'country' => '吉布提' 
		),
		1600000 => array (
				'country' => '吉爾吉斯斯坦' 
		),
		1370000 => array (
				'country' => '多明尼加共和國' 
		),
		2420000 => array (
				'country' => '西班牙',
				'provinces' => array (
						2421200 => array (
								'province' => '巴利亞多利德' 
						),
						2421000 => array (
								'province' => '巴厘阿裏' 
						),
						2421100 => array (
								'province' => '巴倫西亞' 
						),
						2420800 => array (
								'province' => '巴達霍斯' 
						),
						2421400 => array (
								'province' => '巴賽隆納' 
						),
						2421300 => array (
								'province' => '比斯開' 
						),
						2421500 => array (
								'province' => '瓜達拉哈拉' 
						),
						2420900 => array (
								'province' => '布林戈斯' 
						),
						2421900 => array (
								'province' => '加的斯' 
						),
						2423700 => array (
								'province' => '卡斯特利翁' 
						),
						2423600 => array (
								'province' => '卡塞雷斯' 
						),
						2422000 => array (
								'province' => '吉普斯誇' 
						),
						2423300 => array (
								'province' => '那瓦勒' 
						),
						2424700 => array (
								'province' => '托萊多' 
						),
						2420300 => array (
								'province' => '阿利坎特' 
						),
						2420500 => array (
								'province' => '阿拉瓦' 
						),
						2420600 => array (
								'province' => '阿斯圖利亞斯' 
						),
						2420700 => array (
								'province' => '阿維拉' 
						),
						2420200 => array (
								'province' => '阿爾瓦塞特' 
						),
						2420100 => array (
								'province' => '阿爾梅裏亞' 
						),
						2422200 => array (
								'province' => '昆卡' 
						),
						2423400 => array (
								'province' => '帕倫西亞' 
						),
						2422700 => array (
								'province' => '拉里奧哈' 
						),
						2422600 => array (
								'province' => '拉科魯尼亞' 
						),
						2422900 => array (
								'province' => '拉斯帕爾馬斯' 
						),
						2421700 => array (
								'province' => '哈恩' 
						),
						2422100 => array (
								'province' => '科爾多瓦' 
						),
						2425000 => array (
								'province' => '韋斯卡' 
						),
						2424900 => array (
								'province' => '韋爾瓦' 
						),
						2421600 => array (
								'province' => '格拉納達' 
						),
						2424400 => array (
								'province' => '桑坦德' 
						),
						2424200 => array (
								'province' => '索裏亞' 
						),
						2423200 => array (
								'province' => '馬拉加' 
						),
						2423000 => array (
								'province' => '馬德里' 
						),
						2424600 => array (
								'province' => '特魯埃爾' 
						),
						2422300 => array (
								'province' => '萊昂' 
						),
						2422800 => array (
								'province' => '萊裏達' 
						),
						2424800 => array (
								'province' => '塔拉戈納' 
						),
						2423900 => array (
								'province' => '聖克魯斯-德特內裏費' 
						),
						2423800 => array (
								'province' => '塞哥維亞' 
						),
						2424500 => array (
								'province' => '塞維利亞' 
						),
						2423500 => array (
								'province' => '蓬特韋德拉' 
						),
						2422400 => array (
								'province' => '雷阿尔城' 
						),
						2420400 => array (
								'province' => '奧倫塞' 
						),
						2421800 => array (
								'province' => '赫羅納' 
						),
						2424000 => array (
								'province' => '薩拉戈薩?' 
						),
						2424100 => array (
								'province' => '薩拉曼卡' 
						),
						2424300 => array (
								'province' => '薩莫拉' 
						),
						2423100 => array (
								'province' => '穆爾西亞' 
						),
						2422500 => array (
								'province' => '盧戈' 
						) 
				) 
		),
		1180000 => array (
				'country' => '冰島' 
		),
		1810000 => array (
				'country' => '列支敦士登' 
		),
		1290000 => array (
				'country' => '百慕達' 
		),
		2470000 => array (
				'country' => '匈牙利',
				'provinces' => array (
						2470500 => array (
								'province' => '巴奇-基什孔' 
						),
						2470400 => array (
								'province' => '巴蘭尼亞' 
						),
						2470100 => array (
								'province' => '布達佩斯' 
						),
						2471000 => array (
								'province' => '加茲-納傑孔-索爾諾克' 
						),
						2470200 => array (
								'province' => '包爾紹德-奧包烏伊-曾普倫' 
						),
						2471700 => array (
								'province' => '托爾瑙' 
						),
						2471800 => array (
								'province' => '沃什' 
						),
						2470300 => array (
								'province' => '貝凱什' 
						),
						2472000 => array (
								'province' => '佐洛' 
						),
						2471300 => array (
								'province' => '佩斯' 
						),
						2471100 => array (
								'province' => '科馬羅姆' 
						),
						2471500 => array (
								'province' => '索博爾奇-索特馬爾-貝拉格' 
						),
						2471600 => array (
								'province' => '紹莫吉' 
						),
						2470900 => array (
								'province' => '傑爾-莫松-肖普朗' 
						),
						2470600 => array (
								'province' => '費耶爾' 
						),
						2470800 => array (
								'province' => '豪伊杜-比豪尔' 
						),
						2470700 => array (
								'province' => '赫維什' 
						),
						2471900 => array (
								'province' => '維斯普雷姆' 
						),
						2471200 => array (
								'province' => '諾格拉德' 
						),
						2471400 => array (
								'province' => '瓊格拉德' 
						) 
				) 
		),
		2540000 => array (
				'country' => '伊拉克' 
		),
		2530000 => array (
				'country' => '伊朗' 
		),
		2490000 => array (
				'country' => '印度',
				'provinces' => array (
						2494900 => array (
								'province' => '马尔高' 
						),
						2496700 => array (
								'province' => '瓦拉纳西' 
						),
						2491200 => array (
								'province' => '巴罗达' 
						),
						2491600 => array (
								'province' => '巴特那' 
						),
						2492600 => array (
								'province' => '戈尔' 
						),
						2496600 => array (
								'province' => '韦洛尔' 
						),
						2492800 => array (
								'province' => '瓜廖尔' 
						),
						2492500 => array (
								'province' => '甘地讷格尔' 
						),
						2494700 => array (
								'province' => '兰契' 
						),
						2490900 => array (
								'province' => '布巴内斯瓦尔' 
						),
						2490200 => array (
								'province' => '艾哈迈达巴德' 
						),
						2490800 => array (
								'province' => '艾藻尔' 
						),
						2493300 => array (
								'province' => '加尔各答' 
						),
						2493400 => array (
								'province' => '加济阿巴德' 
						),
						2491000 => array (
								'province' => '本地治裏' 
						),
						2494300 => array (
								'province' => '卢迪亚纳' 
						),
						2492900 => array (
								'province' => '古瓦哈提' 
						),
						2492700 => array (
								'province' => '古尔加翁' 
						),
						2495300 => array (
								'province' => '那格浦尔' 
						),
						2491300 => array (
								'province' => '邦纳西克' 
						),
						2497000 => array (
								'province' => '西里古里' 
						),
						2496900 => array (
								'province' => '西隆' 
						),
						2495000 => array (
								'province' => '芒格洛尔' 
						),
						2497200 => array (
								'province' => '因帕爾' 
						),
						2497100 => array (
								'province' => '印多爾' 
						),
						2495200 => array (
								'province' => '迈索尔' 
						),
						2494100 => array (
								'province' => '克塔克' 
						),
						2490300 => array (
								'province' => '阿加尔塔拉' 
						),
						2490400 => array (
								'province' => '阿里格尔' 
						),
						2490700 => array (
								'province' => '阿姆利则' 
						),
						2490500 => array (
								'province' => '阿拉哈巴德' 
						),
						2490100 => array (
								'province' => '阿格拉' 
						),
						2495900 => array (
								'province' => '苏拉' 
						),
						2493900 => array (
								'province' => '坎普尔' 
						),
						2491900 => array (
								'province' => '杜加浦' 
						),
						2492300 => array (
								'province' => '法里达巴德' 
						),
						2491500 => array (
								'province' => '波卡罗' 
						),
						2493700 => array (
								'province' => '金奈' 
						),
						2491700 => array (
								'province' => '昌迪加爾' 
						),
						2494500 => array (
								'province' => '拉杰果德' 
						),
						2495100 => array (
								'province' => '孟买' 
						),
						2492400 => array (
								'province' => '果阿' 
						),
						2492200 => array (
								'province' => '迪马普尔' 
						),
						2494000 => array (
								'province' => '科钦' 
						),
						2491800 => array (
								'province' => '查谟' 
						),
						2496400 => array (
								'province' => '烏代布爾' 
						),
						2493000 => array (
								'province' => '哥印拜陀' 
						),
						2493600 => array (
								'province' => '贾姆纳格尔' 
						),
						2493500 => array (
								'province' => '贾朗达尔' 
						),
						2495600 => array (
								'province' => '浦那' 
						),
						2493100 => array (
								'province' => '海德拉巴' 
						),
						2494800 => array (
								'province' => '馬杜賴' 
						),
						2496200 => array (
								'province' => '特里凡得琅' 
						),
						2491100 => array (
								'province' => '班加羅爾' 
						),
						2495400 => array (
								'province' => '诺伊达' 
						),
						2494600 => array (
								'province' => '勒克瑙' 
						),
						2496500 => array (
								'province' => '维杰亚瓦达' 
						),
						2496300 => array (
								'province' => '塔那' 
						),
						2494400 => array (
								'province' => '鲁尔克拉' 
						),
						2492100 => array (
								'province' => '蒂鲁吉拉伯利' 
						),
						2493800 => array (
								'province' => '焦特布爾' 
						),
						2490600 => array (
								'province' => '奥兰加巴德' 
						),
						2496100 => array (
								'province' => '斯利那加' 
						),
						2491400 => array (
								'province' => '博帕爾' 
						),
						2495800 => array (
								'province' => '塞康德拉巴德' 
						),
						2496000 => array (
								'province' => '塞勒姆' 
						),
						2493200 => array (
								'province' => '賈巴爾普爾' 
						),
						2494200 => array (
								'province' => '赖布尔' 
						),
						2496800 => array (
								'province' => '新德里' 
						),
						2497400 => array (
								'province' => '詹谢普尔' 
						),
						2495700 => array (
								'province' => '維沙哈巴南' 
						),
						2495500 => array (
								'province' => '潘吉姆' 
						),
						2492000 => array (
								'province' => '德拉敦' 
						),
						2497300 => array (
								'province' => '齋普爾' 
						) 
				) 
		),
		2510000 => array (
				'country' => '印度尼西亞',
				'provinces' => array (
						2510800 => array (
								'province' => '大雅加達首都特區' 
						),
						2511700 => array (
								'province' => '日惹特區' 
						),
						2510200 => array (
								'province' => '巴厘' 
						),
						2512800 => array (
								'province' => '中爪哇' 
						),
						2512600 => array (
								'province' => '中加里曼丹' 
						),
						2512700 => array (
								'province' => '中蘇拉威西' 
						),
						2510400 => array (
								'province' => '北蘇門答臘' 
						),
						2510300 => array (
								'province' => '北蘇拉威西' 
						),
						2512500 => array (
								'province' => '占碑' 
						),
						2510100 => array (
								'province' => '邦加－勿裏洞群島' 
						),
						2512100 => array (
								'province' => '西爪哇' 
						),
						2511900 => array (
								'province' => '西努沙登加拉' 
						),
						2512000 => array (
								'province' => '西蘇門答臘' 
						),
						2512300 => array (
								'province' => '伊裏安查亞' 
						),
						2511100 => array (
								'province' => '明古魯' 
						),
						2512400 => array (
								'province' => '亞齊' 
						),
						2510900 => array (
								'province' => '東爪哇' 
						),
						2510500 => array (
								'province' => '東加里曼丹' 
						),
						2510600 => array (
								'province' => '東努沙登加拉' 
						),
						2510700 => array (
								'province' => '東南蘇拉威西' 
						),
						2511400 => array (
								'province' => '南加里曼丹' 
						),
						2511600 => array (
								'province' => '南蘇門答臘' 
						),
						2511500 => array (
								'province' => '南蘇拉威西' 
						),
						2511200 => array (
								'province' => '馬魯古' 
						),
						2511800 => array (
								'province' => '萬丹' 
						),
						2512200 => array (
								'province' => '雅加達' 
						),
						2511300 => array (
								'province' => '楠榜' 
						),
						2511000 => array (
								'province' => '廖內' 
						) 
				) 
		),
		1140000 => array (
				'country' => '安地卡及巴布達' 
		),
		1060000 => array (
				'country' => '安哥拉',
				'provinces' => array (
						1060500 => array (
								'province' => '比耶' 
						),
						1060400 => array (
								'province' => '北隆達' 
						),
						1060300 => array (
								'province' => '北寬紮' 
						),
						1060100 => array (
								'province' => '本戈' 
						),
						1060200 => array (
								'province' => '本格拉' 
						),
						1061400 => array (
								'province' => '卡賓達' 
						),
						1061600 => array (
								'province' => '威拉' 
						),
						1061700 => array (
								'province' => '威熱' 
						),
						1061200 => array (
								'province' => '南隆達' 
						),
						1061100 => array (
								'province' => '南寬紮' 
						),
						1061300 => array (
								'province' => '納米貝' 
						),
						1060900 => array (
								'province' => '馬蘭熱' 
						),
						1060700 => array (
								'province' => '庫內內' 
						),
						1061000 => array (
								'province' => '莫希科' 
						),
						1061500 => array (
								'province' => '萬博' 
						),
						1060600 => array (
								'province' => '寬多庫邦戈' 
						),
						1061800 => array (
								'province' => '薩伊' 
						),
						1060800 => array (
								'province' => '羅安達' 
						) 
				) 
		),
		1000000 => array (
				'country' => '安道爾' 
		),
		2260000 => array (
				'country' => '沙特阿拉伯',
				'provinces' => array (
						2260700 => array (
								'province' => '巴哈' 
						),
						2260800 => array (
								'province' => '布賴代' 
						),
						2260100 => array (
								'province' => '艾卜哈' 
						),
						2261300 => array (
								'province' => '吉達' 
						),
						2261400 => array (
								'province' => '吉贊' 
						),
						2262200 => array (
								'province' => '延布' 
						),
						2261500 => array (
								'province' => '利雅得' 
						),
						2260500 => array (
								'province' => '阿尔卡里' 
						),
						2260600 => array (
								'province' => '阿尔朱拜勒' 
						),
						2260400 => array (
								'province' => '阿尔姆巴拉兹' 
						),
						2260300 => array (
								'province' => '阿尔胡富夫' 
						),
						2260200 => array (
								'province' => '阿爾阿爾' 
						),
						2261200 => array (
								'province' => '哈伊勒' 
						),
						2261000 => array (
								'province' => '哈費爾巴廷' 
						),
						2261800 => array (
								'province' => '納季蘭' 
						),
						2261100 => array (
								'province' => '海米斯穆謝特' 
						),
						2261700 => array (
								'province' => '麥加' 
						),
						2261600 => array (
								'province' => '麥迪那' 
						),
						2262000 => array (
								'province' => '塔布克' 
						),
						2262100 => array (
								'province' => '塔伊夫' 
						),
						2260900 => array (
								'province' => '達曼' 
						),
						2261900 => array (
								'province' => '塞卡卡' 
						) 
				) 
		),
		1310000 => array (
				'country' => '貝寧' 
		),
		1660000 => array (
				'country' => '克羅地亞' 
		),
		2450000 => array (
				'country' => '希臘' 
		),
		1730000 => array (
				'country' => '利比亞' 
		),
		1710000 => array (
				'country' => '利比理亞' 
		),
		1100000 => array (
				'country' => '阿拉伯聯合酋長國',
				'provinces' => array (
						1100200 => array (
								'province' => '艾因' 
						),
						1100400 => array (
								'province' => '沙迦' 
						),
						1100100 => array (
								'province' => '阿布扎比' 
						),
						1100300 => array (
								'province' => '迪拜' 
						) 
				) 
		),
		1070000 => array (
				'country' => '阿根廷',
				'provinces' => array (
						1072200 => array (
								'province' => '內烏肯' 
						),
						1070200 => array (
								'province' => '巴拉那' 
						),
						1070500 => array (
								'province' => '布宜諾賽勒斯' 
						),
						1070300 => array (
								'province' => '布蘭卡港' 
						),
						1072300 => array (
								'province' => '卡塔馬卡' 
						),
						1071000 => array (
								'province' => '克勞斯城' 
						),
						1071200 => array (
								'province' => '里奧戈耶斯省' 
						),
						1070100 => array (
								'province' => '別德馬' 
						),
						1070900 => array (
								'province' => '肯考迪婭' 
						),
						1070400 => array (
								'province' => '波薩達斯' 
						),
						1072100 => array (
								'province' => '門多薩' 
						),
						1071400 => array (
								'province' => '拉里奧哈' 
						),
						1071500 => array (
								'province' => '拉普拉塔' 
						),
						1070700 => array (
								'province' => '胡胡伊' 
						),
						1071100 => array (
								'province' => '科達特斯' 
						),
						1070800 => array (
								'province' => '科爾多瓦' 
						),
						1073400 => array (
								'province' => '烏斯懷亞' 
						),
						1072000 => array (
								'province' => '馬德普拉塔' 
						),
						1073300 => array (
								'province' => '特雷利烏' 
						),
						1073200 => array (
								'province' => '聖尼古拉斯' 
						),
						1073100 => array (
								'province' => '聖米格爾-德圖庫曼' 
						),
						1072400 => array (
								'province' => '聖地牙哥-德爾埃斯特羅' 
						),
						1072800 => array (
								'province' => '聖拉菲爾' 
						),
						1072700 => array (
								'province' => '聖胡安' 
						),
						1072600 => array (
								'province' => '聖菲' 
						),
						1073000 => array (
								'province' => '聖路易斯' 
						),
						1072900 => array (
								'province' => '聖羅莎' 
						),
						1071800 => array (
								'province' => '裏瓦達維亞海軍準將城' 
						),
						1071300 => array (
								'province' => '裏奧誇爾托' 
						),
						1070600 => array (
								'province' => '福莫薩' 
						),
						1071900 => array (
								'province' => '雷西斯滕匹亞' 
						),
						1072500 => array (
								'province' => '薩爾塔' 
						),
						1071600 => array (
								'province' => '羅森' 
						),
						1071700 => array (
								'province' => '羅薩里奧' 
						) 
				) 
		),
		1110000 => array (
				'country' => '阿曼' 
		),
		1120000 => array (
				'country' => '阿塞拜疆' 
		),
		1030000 => array (
				'country' => '阿爾巴尼亞' 
		),
		1040000 => array (
				'country' => '阿爾及利亞' 
		),
		1090000 => array (
				'country' => '阿魯巴' 
		),
		1430000 => array (
				'country' => '芬蘭' 
		),
		2610000 => array (
				'country' => '尚比亞' 
		),
		1460000 => array (
				'country' => '岡比亞' 
		),
		1690000 => array (
				'country' => '肯尼亞' 
		),
		1410000 => array (
				'country' => '法國',
				'provinces' => array (
						1412200 => array (
								'province' => '瓦朗斯' 
						),
						1410500 => array (
								'province' => '巴黎' 
						),
						1411700 => array (
								'province' => '尼斯' 
						),
						1410300 => array (
								'province' => '艾克斯' 
						),
						1410800 => array (
								'province' => '弗雷瑞斯' 
						),
						1411900 => array (
								'province' => '卡昂' 
						),
						1412000 => array (
								'province' => '沙隆' 
						),
						1410600 => array (
								'province' => '貝桑松' 
						),
						1410900 => array (
								'province' => '里昂' 
						),
						1411100 => array (
								'province' => '里爾' 
						),
						1411300 => array (
								'province' => '利摩日' 
						),
						1410400 => array (
								'province' => '阿雅克修' 
						),
						1410100 => array (
								'province' => '阿爾勒' 
						),
						1412300 => array (
								'province' => '亞眠' 
						),
						1411800 => array (
								'province' => '南特' 
						),
						1411600 => array (
								'province' => '馬賽' 
						),
						1411500 => array (
								'province' => '梅斯' 
						),
						1410700 => array (
								'province' => '第戎' 
						),
						1411400 => array (
								'province' => '蒙彼利埃' 
						),
						1411200 => array (
								'province' => '雷恩' 
						),
						1410200 => array (
								'province' => '奧爾良' 
						),
						1412100 => array (
								'province' => '圖盧茲' 
						),
						1411000 => array (
								'province' => '盧昂' 
						) 
				) 
		),
		1200000 => array (
				'country' => '波多黎各' 
		),
		1250000 => array (
				'country' => '波蘭' 
		),
		2400000 => array (
				'country' => '委內瑞拉',
				'provinces' => array (
						2400500 => array (
								'province' => '巴里納斯' 
						),
						2400900 => array (
								'province' => '瓜裏科' 
						),
						2401000 => array (
								'province' => '加拉加斯' 
						),
						2401700 => array (
								'province' => '卡拉沃沃' 
						),
						2401400 => array (
								'province' => '米蘭達' 
						),
						2400400 => array (
								'province' => '安索阿特吉' 
						),
						2400100 => array (
								'province' => '阿拉瓜' 
						),
						2400200 => array (
								'province' => '阿馬庫羅三角洲' 
						),
						2400300 => array (
								'province' => '阿普雷' 
						),
						2400800 => array (
								'province' => '法爾孔' 
						),
						2400700 => array (
								'province' => '波圖格薩' 
						),
						2402300 => array (
								'province' => '亞拉奎' 
						),
						2402400 => array (
								'province' => '亞馬孫' 
						),
						2401300 => array (
								'province' => '拉臘' 
						),
						2401100 => array (
								'province' => '科赫德斯' 
						),
						2400600 => array (
								'province' => '玻利瓦爾省' 
						),
						2402000 => array (
								'province' => '特魯希略' 
						),
						2401600 => array (
								'province' => '莫納加斯' 
						),
						2401500 => array (
								'province' => '梅里達' 
						),
						2402100 => array (
								'province' => '塔奇拉' 
						),
						2402200 => array (
								'province' => '新埃斯帕塔' 
						),
						2401200 => array (
								'province' => '聯邦屬地' 
						),
						2401800 => array (
								'province' => '蘇克雷' 
						),
						2401900 => array (
								'province' => '蘇利亞' 
						) 
				) 
		),
		2060000 => array (
				'country' => '帕勞群島' 
		),
		2190000 => array (
				'country' => '所羅門群島' 
		),
		2570000 => array (
				'country' => '亞美尼亞' 
		),
		1780000 => array (
				'country' => '拉脫維亞' 
		),
		2520000 => array (
				'country' => '英國',
				'provinces' => array (
						2520100 => array (
								'province' => '北愛爾蘭',
								'citys' => array (
										2520101 => '貝爾法斯特',
										2520103 => '利斯本',
										2520104 => '紐裏',
										2520102 => '德里' 
								) 
						),
						2520400 => array (
								'province' => '英格兰',
								'citys' => array (
										2520407 => '巴斯',
										2520427 => '牛津',
										2520405 => '布里斯托爾',
										2520403 => '布拉德福德',
										2520404 => '布萊頓霍夫',
										2520433 => '卡萊爾',
										2520415 => '考文垂',
										2520421 => '列斯特',
										2520449 => '伊利',
										2520446 => '伍斯特',
										2520443 => '伍爾弗漢普頓',
										2520430 => '朴茨茅斯',
										2520420 => '利奇菲爾德',
										2520422 => '利物浦',
										2520423 => '利茲',
										2520406 => '伯明罕',
										2520414 => '坎特伯雷',
										2520434 => '奇賈斯特',
										2520402 => '彼得伯勒',
										2520417 => '林肯',
										2520448 => '約克',
										2520444 => '威爾斯',
										2520425 => '南安普敦',
										2520445 => '韋克菲爾德',
										2520416 => '倫敦',
										2520410 => '格洛斯特',
										2520437 => '桑德蘭',
										2520429 => '紐卡斯爾',
										2520439 => '索福特',
										2520438 => '索爾斯堡',
										2520441 => '特倫特河畔斯多克',
										2520440 => '特魯羅',
										2520401 => '埃克塞特',
										2520424 => '曼徹斯特',
										2520431 => '普利茅斯',
										2520432 => '普勒斯頓',
										2520436 => '聖阿本斯',
										2520435 => '賈斯特',
										2520419 => '裏彭',
										2520442 => '溫徹斯特',
										2520412 => '赫裏福德',
										2520411 => '赫爾河畔京斯敦',
										2520413 => '劍橋',
										2520426 => '諾丁漢',
										2520428 => '諾里奇',
										2520408 => '德比',
										2520409 => '德罕',
										2520447 => '謝菲爾德',
										2520418 => '蘭開斯特' 
								) 
						),
						2520300 => array (
								'province' => '威尔士',
								'citys' => array (
										2520303 => '卡迪夫',
										2520302 => '紐波特',
										2520301 => '班戈',
										2520304 => '斯旺西' 
								) 
						),
						2520200 => array (
								'province' => '蘇格蘭',
								'citys' => array (
										2520203 => '丹迪',
										2520206 => '因弗內斯',
										2520201 => '亞伯丁',
										2520204 => '格拉斯哥',
										2520205 => '斯特靈',
										2520202 => '愛丁堡' 
								) 
						) 
				) 
		),
		2600000 => array (
				'country' => '直布羅陀' 
		),
		1920000 => array (
				'country' => '茅利塔尼亞' 
		),
		1880000 => array (
				'country' => '孟加拉國' 
		),
		2330000 => array (
				'country' => '坦桑尼亞' 
		),
		1580000 => array (
				'country' => '哈薩克斯坦' 
		),
		2480000 => array (
				'country' => '約旦' 
		),
		1550000 => array (
				'country' => '洪都拉斯' 
		),
		2660000 => array (
				'country' => '香港',
				'provinces' => array (
						2660600 => array (
								'province' => '九龍城區' 
						),
						2660200 => array (
								'province' => '大埔區' 
						),
						2661300 => array (
								'province' => '屯門區' 
						),
						2661700 => array (
								'province' => '元朗區' 
						),
						2661800 => array (
								'province' => '中西區' 
						),
						2660100 => array (
								'province' => '北區' 
						),
						2661500 => array (
								'province' => '西貢區' 
						),
						2661200 => array (
								'province' => '沙田區' 
						),
						2661600 => array (
								'province' => '油尖旺區' 
						),
						2660300 => array (
								'province' => '東區' 
						),
						2661000 => array (
								'province' => '荃灣區' 
						),
						2660900 => array (
								'province' => '南區' 
						),
						2661100 => array (
								'province' => '深水埗區' 
						),
						2660500 => array (
								'province' => '黃大仙區' 
						),
						2660700 => array (
								'province' => '葵青區' 
						),
						2660800 => array (
								'province' => '離島區' 
						),
						2660400 => array (
								'province' => '觀塘區' 
						),
						2661400 => array (
								'province' => '灣仔區' 
						) 
				) 
		),
		1700000 => array (
				'country' => '科威特' 
		),
		2050000 => array (
				'country' => '挪威' 
		),
		2010000 => array (
				'country' => '南非',
				'provinces' => array (
						2013100 => array (
								'province' => '內爾斯普雷特' 
						),
						2010900 => array (
								'province' => '比索' 
						),
						2010800 => array (
								'province' => '比勒陀利亞' 
						),
						2013200 => array (
								'province' => '尼爾斯特隆' 
						),
						2010600 => array (
								'province' => '布隆方丹' 
						),
						2010700 => array (
								'province' => '布隆克斯特斯普利特' 
						),
						2010500 => array (
								'province' => '布雷達斯多普' 
						),
						2010100 => array (
								'province' => '艾利弗山' 
						),
						2011600 => array (
								'province' => '弗裏尼欣' 
						),
						2011500 => array (
								'province' => '弗雷堡' 
						),
						2012800 => array (
								'province' => '米德爾堡' 
						),
						2014700 => array (
								'province' => '西博福特' 
						),
						2013700 => array (
								'province' => '托霍延杜' 
						),
						2015000 => array (
								'province' => '伊麗沙伯港' 
						),
						2014600 => array (
								'province' => '伍斯特' 
						),
						2012000 => array (
								'province' => '克萊克斯多普' 
						),
						2012700 => array (
								'province' => '利斯滕堡' 
						),
						2010200 => array (
								'province' => '阿平頓' 
						),
						2012900 => array (
								'province' => '姆庫澤' 
						),
						2011800 => array (
								'province' => '金伯利' 
						),
						2012300 => array (
								'province' => '昆士敦' 
						),
						2011200 => array (
								'province' => '東巴克利' 
						),
						2011400 => array (
								'province' => '東倫敦' 
						),
						2010300 => array (
								'province' => '彼德馬里茨堡' 
						),
						2010400 => array (
								'province' => '彼德斯堡' 
						),
						2014900 => array (
								'province' => '約翰尼斯堡' 
						),
						2014200 => array (
								'province' => '韋茨肖克' 
						),
						2014300 => array (
								'province' => '韋爾科姆' 
						),
						2011700 => array (
								'province' => '格羅布萊斯達爾' 
						),
						2014500 => array (
								'province' => '烏姆塔塔' 
						),
						2014400 => array (
								'province' => '烏倫迪' 
						),
						2013300 => array (
								'province' => '紐卡斯爾' 
						),
						2013800 => array (
								'province' => '特克索波' 
						),
						2014100 => array (
								'province' => '特隆普斯堡' 
						),
						2012100 => array (
								'province' => '庫魯曼' 
						),
						2012400 => array (
								'province' => '理查茲灣' 
						),
						2012600 => array (
								'province' => '萊迪史密斯' 
						),
						2011900 => array (
								'province' => '基雅尼' 
						),
						2012200 => array (
								'province' => '開普敦' 
						),
						2013400 => array (
								'province' => '喬治' 
						),
						2013500 => array (
								'province' => '瑟孔達' 
						),
						2013900 => array (
								'province' => '跳羚' 
						),
						2011300 => array (
								'province' => '鄧迪' 
						),
						2014000 => array (
								'province' => '圖拉馬哈謝' 
						),
						2011000 => array (
								'province' => '德阿爾' 
						),
						2011100 => array (
								'province' => '德班' 
						),
						2013600 => array (
								'province' => '薩索爾堡' 
						),
						2013000 => array (
								'province' => '穆裏斯堡' 
						),
						2014800 => array (
								'province' => '謝普斯通港' 
						),
						2012500 => array (
								'province' => '蘭德方丹' 
						) 
				) 
		),
		1870000 => array (
				'country' => '美國',
				'provinces' => array (
						1873300 => array (
								'province' => '內布拉斯加',
								'citys' => array (
										1873302 => '貝爾維尤',
										1873303 => '林肯',
										1873301 => '奧馬哈' 
								) 
						),
						1873500 => array (
								'province' => '內華達州',
								'citys' => array (
										1873502 => '北拉斯維加斯',
										1873507 => '卡森城',
										1873505 => '里諾',
										1873504 => '亨德森',
										1873503 => '佛吉尼亞城',
										1873506 => '拉斯維加斯',
										1873501 => '埃爾科',
										1873508 => '斯帕克斯' 
								) 
						),
						1873900 => array (
								'province' => '田納西',
								'citys' => array (
										1873908 => '士麥那',
										1873907 => '三城區',
										1873901 => '布利斯托',
										1873903 => '金斯波特',
										1873904 => '孟菲斯',
										1873902 => '查塔努加',
										1873906 => '納什維爾',
										1873909 => '斯普林希爾',
										1873910 => '詹森城',
										1873905 => '諾克斯維爾' 
								) 
						),
						1871800 => array (
								'province' => '加利福尼亞',
								'citys' => array (
										1871801 => '三藩市',
										1871802 => '洛杉磯',
										1871804 => '聖何塞',
										1871803 => '聖達戈' 
								) 
						),
						1870700 => array (
								'province' => '北卡羅來納',
								'citys' => array (
										1870701 => '艾許維爾',
										1870702 => '杜罕',
										1870706 => '洛利杜罕都會區',
										1870703 => '格林斯伯勒',
										1870707 => '夏洛特',
										1870704 => '教堂山',
										1870705 => '羅利' 
								) 
						),
						1870600 => array (
								'province' => '北達科他',
								'citys' => array (
										1870602 => '大福克斯',
										1870603 => '法戈',
										1870601 => '俾斯麥',
										1870604 => '邁諾特' 
								) 
						),
						1874200 => array (
								'province' => '西佛吉尼亞',
								'citys' => array (
										1874202 => '亨廷頓',
										1874203 => '帕克斯堡',
										1874201 => '查爾斯頓' 
								) 
						),
						1874800 => array (
								'province' => '伊利諾斯州',
								'citys' => array (
										1874807 => '丹維尓',
										1874808 => '厄巴納-香檳',
										1874803 => '布隆明頓',
										1874813 => '皮奧里亞',
										1874814 => '卡本代爾',
										1874818 => '芝加哥',
										1874817 => '沃其根',
										1874806 => '東聖路易斯',
										1874805 => '迪卡爾布',
										1874804 => '迪凱特',
										1874816 => '森特勒利亞',
										1874815 => '斯普林菲爾德',
										1874809 => '蓋爾斯堡',
										1874801 => '奧爾頓',
										1874802 => '奧羅拉',
										1874812 => '諾黙爾',
										1874810 => '羅克艾蘭',
										1874811 => '羅克福德' 
								) 
						),
						1874700 => array (
								'province' => '印第安那',
								'citys' => array (
										1874703 => '印弟安納波里斯',
										1874702 => '韋恩堡',
										1874701 => '埃文斯維爾' 
								) 
						),
						1870300 => array (
								'province' => '阿肯色',
								'citys' => array (
										1870303 => '小石城',
										1870302 => '史密斯堡',
										1870301 => '菲耶特維爾' 
								) 
						),
						1870400 => array (
								'province' => '阿拉巴馬',
								'citys' => array (
										1870401 => '伯明罕',
										1870402 => '莫比爾',
										1870403 => '蒙哥馬利' 
								) 
						),
						1870500 => array (
								'province' => '阿拉斯加',
								'citys' => array (
										1870503 => '朱諾',
										1870501 => '安克雷奇',
										1870502 => '費爾班克斯' 
								) 
						),
						1875100 => array (
								'province' => '佐治亞',
								'citys' => array (
										1875104 => '沙瓦納',
										1875105 => '亞特蘭大',
										1875102 => '哥倫布',
										1875103 => '梅肯',
										1875101 => '奧古斯塔' 
								) 
						),
						1871400 => array (
								'province' => '佛蒙特',
								'citys' => array (
										1871401 => '伯靈頓',
										1871402 => '拉特蘭',
										1871403 => '南伯靈頓' 
								) 
						),
						1871300 => array (
								'province' => '佛羅里達',
								'citys' => array (
										1871306 => '卡納維拉爾角',
										1871309 => '坦帕',
										1871303 => '基韋斯特',
										1871308 => '達拉哈西',
										1871302 => '傑克遜維爾',
										1871307 => '聖彼德斯堡市',
										1871301 => '奧蘭多',
										1871305 => '邁阿密',
										1871304 => '羅德岱堡' 
								) 
						),
						1872200 => array (
								'province' => '肯塔基',
								'citys' => array (
										1872201 => '列克星敦',
										1872202 => '路易斯維爾',
										1872203 => '歐文思伯勒' 
								) 
						),
						1872700 => array (
								'province' => '明尼蘇達',
								'citys' => array (
										1872702 => '明尼阿波利斯',
										1872703 => '聖保羅',
										1872701 => '羅切斯特' 
								) 
						),
						1874900 => array (
								'province' => '亞利桑那',
								'citys' => array (
										1874904 => '史卡茲代爾',
										1874905 => '坦普',
										1874902 => '格蘭代爾',
										1874903 => '梅薩山',
										1874901 => '鳳凰城',
										1874906 => '圖森',
										1874907 => '優瑪' 
								) 
						),
						1871900 => array (
								'province' => '科羅拉多',
								'citys' => array (
										1871905 => '大章克興',
										1871904 => '丹佛',
										1871902 => '阿斯彭',
										1871906 => '科羅拉多斯普林斯',
										1871908 => '韋爾',
										1871907 => '柯林斯堡',
										1871903 => '博爾德',
										1871901 => '奧羅拉' 
								) 
						),
						1874100 => array (
								'province' => '威斯康星',
								'citys' => array (
										1874111 => '沃索',
										1874112 => '希博伊根',
										1874101 => '阿普尓頓',
										1874105 => '拉克羅斯',
										1874106 => '拉辛',
										1874103 => '格林灣',
										1874109 => '馬尼托沃克',
										1874108 => '密爾沃基',
										1874104 => '基諾沙',
										1874102 => '奧什科什',
										1874107 => '邁迪遜',
										1874110 => '歐克萊尓' 
								) 
						),
						1873600 => array (
								'province' => '南卡羅來納',
								'citys' => array (
										1873601 => '北查爾斯頓',
										1873602 => '查爾斯頓',
										1873603 => '哥倫比亞' 
								) 
						),
						1873400 => array (
								'province' => '南達科他',
								'citys' => array (
										1873401 => '亞伯丁',
										1873402 => '拉皮德城',
										1873403 => '蘇福爾斯' 
								) 
						),
						1871000 => array (
								'province' => '俄亥俄',
								'citys' => array (
										1871001 => '代頓',
										1871004 => '托萊多',
										1871003 => '克利夫蘭',
										1871005 => '辛辛那提',
										1871002 => '哥倫布' 
								) 
						),
						1871200 => array (
								'province' => '俄勒岡',
								'citys' => array (
										1871215 => '尤金',
										1871208 => '火山口湖',
										1871201 => '本德',
										1871202 => '波特蘭',
										1871207 => '胡德里弗',
										1871210 => '科瓦利斯',
										1871206 => '格蘭茲帕斯',
										1871209 => '庫斯貝',
										1871211 => '梅德福',
										1871205 => '達拉斯',
										1871203 => '達爾斯',
										1871204 => '蒂拉穆克',
										1871214 => '斯普林菲爾德',
										1871212 => '聖海倫斯',
										1871213 => '賽勒姆' 
								) 
						),
						1871500 => array (
								'province' => '哥倫比亞特區',
								'citys' => array (
										1871501 => '華盛頓哥倫比亞特區' 
								) 
						),
						1874500 => array (
								'province' => '夏威夷',
								'citys' => array (
										1874503 => '希洛',
										1874501 => '凱盧阿',
										1874502 => '檀香山' 
								) 
						),
						1873700 => array (
								'province' => '紐約',
								'citys' => array (
										1873701 => '布法羅',
										1873703 => '紐約市',
										1873702 => '羅切斯特' 
								) 
						),
						1872600 => array (
								'province' => '馬里蘭',
								'citys' => array (
										1872601 => '巴爾的摩',
										1872602 => '蓋瑟斯堡',
										1872603 => '羅克維爾' 
								) 
						),
						1873800 => array (
								'province' => '特拉華',
								'citys' => array (
										1873801 => '多佛',
										1873803 => '威明頓',
										1873802 => '紐華克' 
								) 
						),
						1871700 => array (
								'province' => '華盛頓',
								'citys' => array (
										1871703 => '西雅圖',
										1871702 => '塔科馬',
										1871701 => '斯波坎' 
								) 
						),
						1872000 => array (
								'province' => '康涅狄格',
								'citys' => array (
										1872001 => '布里奇波特',
										1872005 => '米德爾頓',
										1872008 => '沃特伯裏',
										1872004 => '哈特福德',
										1872007 => '韋斯特波特',
										1872003 => '格林尼治',
										1872006 => '紐黑文',
										1872002 => '達裏恩',
										1872009 => '新不列顛' 
								) 
						),
						1872900 => array (
								'province' => '麻塞諸塞',
								'citys' => array (
										1872903 => '伍斯特',
										1872901 => '波士頓',
										1872902 => '斯普林菲爾德' 
								) 
						),
						1873100 => array (
								'province' => '密西西比',
								'citys' => array (
										1873101 => '比洛西克',
										1873104 => '哈蒂斯堡',
										1873103 => '格林維爾',
										1873102 => '格爾夫波特',
										1873105 => '傑克遜',
										1873107 => '維克斯堡',
										1873106 => '默里迪恩' 
								) 
						),
						1873000 => array (
								'province' => '密歇根',
								'citys' => array (
										1873003 => '巴特爾克里克',
										1873007 => '弗林特',
										1873012 => '卡拉馬袓',
										1873016 => '休倫港',
										1873001 => '安娜堡',
										1873015 => '沃倫',
										1873002 => '貝城',
										1873006 => '底特律',
										1873004 => '迪爾伯恩',
										1873005 => '急流城',
										1873010 => '馬斯基根',
										1873013 => '薩吉諾',
										1873008 => '懷恩多特',
										1873014 => '蘇聖瑪麗',
										1873011 => '龐菷亞克',
										1873009 => '蘭辛' 
								) 
						),
						1872800 => array (
								'province' => '密蘇裏',
								'citys' => array (
										1872803 => '坎薩斯城',
										1872801 => '哥倫比亞',
										1872802 => '傑佛遜市',
										1872805 => '斯普林菲爾德',
										1872804 => '聖路易斯' 
								) 
						),
						1872100 => array (
								'province' => '堪薩斯',
								'citys' => array (
										1872108 => '托皮卡',
										1872101 => '阿比林',
										1872104 => '坎薩斯城',
										1872103 => '哈欽森',
										1872109 => '威奇托',
										1872106 => '萊文沃思',
										1872107 => '曼哈頓',
										1872105 => '勞倫斯',
										1872102 => '奧弗蘭公園' 
								) 
						),
						1875000 => array (
								'province' => '猶他',
								'citys' => array (
										1875007 => '西瓦利城',
										1875004 => '派克城',
										1875005 => '普羅沃',
										1875006 => '聖喬治',
										1875002 => '雷登',
										1875001 => '奧格登',
										1875003 => '歐仁',
										1875008 => '鹽湖城' 
								) 
						),
						1872500 => array (
								'province' => '蒙大拿',
								'citys' => array (
										1872502 => '大瀑布村',
										1872501 => '比林茲',
										1872503 => '米蘇拉' 
								) 
						),
						1870200 => array (
								'province' => '愛荷華',
								'citys' => array (
										1870201 => '得梅因',
										1870202 => '達文波特',
										1870203 => '錫特拉皮茲' 
								) 
						),
						1870100 => array (
								'province' => '愛達荷州',
								'citys' => array (
										1870102 => '布萊克富特',
										1870103 => '波卡特洛',
										1870112 => '亞美利加瀑布城',
										1870105 => '科達倫',
										1870110 => '豈徹姆',
										1870108 => '莫斯科',
										1870111 => '森瓦利',
										1870104 => '博伊西',
										1870101 => '愛達荷福爾斯',
										1870109 => '楠帕',
										1870107 => '墨菲',
										1870106 => '劉易斯頓' 
								) 
						),
						1874300 => array (
								'province' => '新罕布夏',
								'citys' => array (
										1874303 => '納舒厄',
										1874301 => '康科特',
										1874302 => '曼徹斯特' 
								) 
						),
						1874400 => array (
								'province' => '新墨西哥',
								'citys' => array (
										1874401 => '阿爾伯克爾基',
										1874402 => '拉斯克魯塞斯',
										1874404 => '聖菲',
										1874403 => '羅茲韋爾' 
								) 
						),
						1874600 => array (
								'province' => '新澤西',
								'citys' => array (
										1874602 => '派特森',
										1874601 => '紐華克',
										1874603 => '澤西城' 
								) 
						),
						1872400 => array (
								'province' => '路易斯安那',
								'citys' => array (
										1872401 => '巴吞魯日',
										1872402 => '什里夫波特',
										1872403 => '新奧爾良' 
								) 
						),
						1870800 => array (
								'province' => '賓夕法尼亞',
								'citys' => array (
										1870803 => '匹茲堡',
										1870801 => '亞蘭敦',
										1870802 => '費城' 
								) 
						),
						1871100 => array (
								'province' => '奧克拉荷馬',
								'citys' => array (
										1871103 => '塔爾薩',
										1871101 => '奧克拉荷馬城',
										1871102 => '諾曼' 
								) 
						),
						1874000 => array (
								'province' => '維吉尼亞',
								'citys' => array (
										1874003 => '切薩皮克',
										1874001 => '佛吉尼亞比奇',
										1874002 => '諾福克' 
								) 
						),
						1873200 => array (
								'province' => '緬因',
								'citys' => array (
										1873202 => '波特蘭',
										1873201 => '班戈',
										1873203 => '劉易斯頓' 
								) 
						),
						1870900 => array (
								'province' => '德州',
								'citys' => array (
										1870905 => '交維斯頓',
										1870909 => '休士頓',
										1870906 => '拉雷多',
										1870904 => '哥帕斯基斯蒂',
										1870901 => '埃爾帕索',
										1870907 => '麥卡倫',
										1870903 => '達拉斯',
										1870908 => '聖安東尼奧',
										1870902 => '奧斯丁' 
								) 
						),
						1871600 => array (
								'province' => '懷俄明州',
								'citys' => array (
										1871604 => '卡斯帕',
										1871603 => '拉勒米',
										1871606 => '夏延',
										1871601 => '埃文斯頓',
										1871605 => '謝里登',
										1871602 => '羅克斯普林' 
								) 
						),
						1872300 => array (
								'province' => '羅德島',
								'citys' => array (
										1872305 => '文索基特',
										1872307 => '沃威克',
										1872302 => '克蘭斯頓',
										1872301 => '波塔基特',
										1872306 => '韋斯特利',
										1872303 => '紐波特',
										1872304 => '普羅維登斯' 
								) 
						) 
				) 
		),
		1280000 => array (
				'country' => '玻利維亞' 
		),
		1390000 => array (
				'country' => '俄羅斯',
				'provinces' => array (
						1397700 => array (
								'province' => '下諾夫哥羅德' 
						),
						1391300 => array (
								'province' => '巴爾瑙爾' 
						),
						1395500 => array (
								'province' => '切博克薩雷' 
						),
						1395600 => array (
								'province' => '切爾克斯克' 
						),
						1392600 => array (
								'province' => '戈爾諾－阿勒泰斯克' 
						),
						1391500 => array (
								'province' => '比羅比詹' 
						),
						1391700 => array (
								'province' => '布良斯克' 
						),
						1391600 => array (
								'province' => '布拉戈維申斯克' 
						),
						1390600 => array (
								'province' => '艾理斯塔' 
						),
						1393100 => array (
								'province' => '加里寧格勒' 
						),
						1392400 => array (
								'province' => '弗拉季高加索' 
						),
						1392500 => array (
								'province' => '弗拉基米爾' 
						),
						1395700 => array (
								'province' => '卡盧加' 
						),
						1396900 => array (
								'province' => '托木斯克' 
						),
						1398500 => array (
								'province' => '伊萬諾沃' 
						),
						1397900 => array (
								'province' => '伊爾庫茨克' 
						),
						1398300 => array (
								'province' => '伊熱夫斯克' 
						),
						1392300 => array (
								'province' => '伏爾加格勒' 
						),
						1397200 => array (
								'province' => '沃洛格達' 
						),
						1397300 => array (
								'province' => '沃羅涅什' 
						),
						1394000 => array (
								'province' => '克孜勒' 
						),
						1393600 => array (
								'province' => '克拉斯諾亞爾斯克' 
						),
						1393500 => array (
								'province' => '克拉斯諾達爾' 
						),
						1393700 => array (
								'province' => '克麥羅沃' 
						),
						1392000 => array (
								'province' => '赤塔' 
						),
						1391100 => array (
								'province' => '別爾哥羅德' 
						),
						1394100 => array (
								'province' => '利佩茨克' 
						),
						1390100 => array (
								'province' => '阿巴坎' 
						),
						1390300 => array (
								'province' => '阿金斯科耶' 
						),
						1390700 => array (
								'province' => '阿納德爾' 
						),
						1390800 => array (
								'province' => '阿斯特拉罕' 
						),
						1390200 => array (
								'province' => '阿爾漢格爾斯克' 
						),
						1391900 => array (
								'province' => '車裏雅賓斯克' 
						),
						1391400 => array (
								'province' => '伯力' 
						),
						1391800 => array (
								'province' => '奔薩' 
						),
						1395300 => array (
								'province' => '帕拉納' 
						),
						1398000 => array (
								'province' => '亞庫次克' 
						),
						1396700 => array (
								'province' => '坦波夫' 
						),
						1390900 => array (
								'province' => '彼得羅巴甫洛夫斯克' 
						),
						1391000 => array (
								'province' => '彼得羅紮沃茨克' 
						),
						1391200 => array (
								'province' => '彼爾姆' 
						),
						1398400 => array (
								'province' => '約什卡爾奧拉' 
						),
						1395800 => array (
								'province' => '秋明' 
						),
						1393900 => array (
								'province' => '科斯特羅馬' 
						),
						1395200 => array (
								'province' => '南薩哈林斯克' 
						),
						1392700 => array (
								'province' => '格羅茲尼' 
						),
						1397100 => array (
								'province' => '烏法' 
						),
						1397600 => array (
								'province' => '烏斯季奧爾登斯基' 
						),
						1397500 => array (
								'province' => '烏裏揚諾夫斯克' 
						),
						1397400 => array (
								'province' => '烏蘭烏德' 
						),
						1395100 => array (
								'province' => '納裏揚馬爾' 
						),
						1394900 => array (
								'province' => '納爾奇克' 
						),
						1394500 => array (
								'province' => '馬加丹' 
						),
						1394600 => array (
								'province' => '馬加斯' 
						),
						1394400 => array (
								'province' => '馬哈奇卡拉' 
						),
						1397000 => array (
								'province' => '特維爾' 
						),
						1393400 => array (
								'province' => '庫爾斯克' 
						),
						1393300 => array (
								'province' => '庫爾幹' 
						),
						1393200 => array (
								'province' => '庫德姆卡爾' 
						),
						1394800 => array (
								'province' => '莫斯科' 
						),
						1394200 => array (
								'province' => '梁贊' 
						),
						1392200 => array (
								'province' => '鄂木斯克' 
						),
						1392800 => array (
								'province' => '符拉迪沃斯托克' 
						),
						1393000 => array (
								'province' => '基洛夫' 
						),
						1398200 => array (
								'province' => '葉卡捷林堡' 
						),
						1393800 => array (
								'province' => '喀山' 
						),
						1396600 => array (
								'province' => '斯塔夫羅波爾' 
						),
						1396500 => array (
								'province' => '斯摩棱斯克' 
						),
						1395400 => array (
								'province' => '普斯科夫' 
						),
						1398100 => array (
								'province' => '雅羅斯拉夫爾' 
						),
						1392100 => array (
								'province' => '頓河畔羅斯托夫' 
						),
						1395900 => array (
								'province' => '聖彼德堡' 
						),
						1396000 => array (
								'province' => '瑟克特夫卡爾' 
						),
						1397800 => array (
								'province' => '新西伯利亞' 
						),
						1390400 => array (
								'province' => '奧倫堡' 
						),
						1390500 => array (
								'province' => '奧廖爾' 
						),
						1396800 => array (
								'province' => '圖拉' 
						),
						1392900 => array (
								'province' => '漢特－曼西斯克' 
						),
						1394300 => array (
								'province' => '摩爾曼斯克' 
						),
						1394700 => array (
								'province' => '邁科普' 
						),
						1395000 => array (
								'province' => '諾夫哥羅德' 
						),
						1396100 => array (
								'province' => '薩列哈爾德' 
						),
						1396300 => array (
								'province' => '薩拉托夫' 
						),
						1396400 => array (
								'province' => '薩馬拉' 
						),
						1396200 => array (
								'province' => '薩蘭斯克' 
						) 
				) 
		),
		1220000 => array (
				'country' => '保加利亞' 
		),
		1650000 => array (
				'country' => '柬埔寨',
				'provinces' => array (
						1652100 => array (
								'province' => '上丁' 
						),
						1651500 => array (
								'province' => '戈公' 
						),
						1650500 => array (
								'province' => '白馬市' 
						),
						1652200 => array (
								'province' => '西哈努克市' 
						),
						1650300 => array (
								'province' => '波羅勉' 
						),
						1651600 => array (
								'province' => '金邊市' 
						),
						1650400 => array (
								'province' => '拜林市' 
						),
						1651100 => array (
								'province' => '茶膠' 
						),
						1650900 => array (
								'province' => '柏威夏' 
						),
						1651700 => array (
								'province' => '桔井' 
						),
						1651300 => array (
								'province' => '貢布' 
						),
						1651900 => array (
								'province' => '馬德望' 
						),
						1650200 => array (
								'province' => '班迭棉吉' 
						),
						1651200 => array (
								'province' => '柴楨' 
						),
						1652000 => array (
								'province' => '菩薩' 
						),
						1651800 => array (
								'province' => '蒙多基裏' 
						),
						1651400 => array (
								'province' => '幹丹' 
						),
						1650100 => array (
								'province' => '奧多棉吉' 
						),
						1650700 => array (
								'province' => '磅士卑' 
						),
						1650800 => array (
								'province' => '磅同' 
						),
						1650600 => array (
								'province' => '磅清揚' 
						),
						1651000 => array (
								'province' => '磅湛' 
						),
						1652300 => array (
								'province' => '暹粒' 
						),
						1652400 => array (
								'province' => '臘塔納基裏' 
						) 
				) 
		),
		1520000 => array (
				'country' => '格林伍德' 
		),
		1480000 => array (
				'country' => '格恩西島' 
		),
		1510000 => array (
				'country' => '格陵蘭' 
		),
		2350000 => array (
				'country' => '烏干達' 
		),
		2360000 => array (
				'country' => '烏克蘭',
				'provinces' => array (
						2362300 => array (
								'province' => '文尼察' 
						),
						2361900 => array (
								'province' => '日托米爾' 
						),
						2361700 => array (
								'province' => '切爾尼戈夫' 
						),
						2361800 => array (
								'province' => '切爾卡瑟' 
						),
						2361600 => array (
								'province' => '切爾諾夫策' 
						),
						2361500 => array (
								'province' => '尼古拉耶夫' 
						),
						2362100 => array (
								'province' => '外喀爾巴阡' 
						),
						2362400 => array (
								'province' => '伊萬－弗蘭科夫州' 
						),
						2362200 => array (
								'province' => '沃倫' 
						),
						2361100 => array (
								'province' => '克裏米亞自治共和國' 
						),
						2361400 => array (
								'province' => '利沃夫' 
						),
						2360200 => array (
								'province' => '波爾塔瓦' 
						),
						2360500 => array (
								'province' => '哈爾科夫' 
						),
						2362500 => array (
								'province' => '紮波羅熱' 
						),
						2360300 => array (
								'province' => '第聶伯羅波得羅夫斯克' 
						),
						2360800 => array (
								'province' => '捷爾諾波爾' 
						),
						2361000 => array (
								'province' => '基洛夫格勒' 
						),
						2360900 => array (
								'province' => '基輔' 
						),
						2360400 => array (
								'province' => '頓涅茨克' 
						),
						2360100 => array (
								'province' => '奧德薩' 
						),
						2360700 => array (
								'province' => '赫梅利尼茨基' 
						),
						2360600 => array (
								'province' => '赫爾松州' 
						),
						2361300 => array (
								'province' => '盧甘斯克' 
						),
						2362000 => array (
								'province' => '蘇梅' 
						),
						2361200 => array (
								'province' => '羅夫諾' 
						) 
				) 
		),
		2380000 => array (
				'country' => '烏拉圭' 
		),
		2410000 => array (
				'country' => '烏茲別克斯坦' 
		),
		1500000 => array (
				'country' => '哥倫比亞' 
		),
		1530000 => array (
				'country' => '哥斯大黎加' 
		),
		2290000 => array (
				'country' => '泰國',
				'provinces' => array (
						2291900 => array (
								'province' => '大城' 
						),
						2297300 => array (
								'province' => '也拉' 
						),
						2291100 => array (
								'province' => '巴吞他尼' 
						),
						2291200 => array (
								'province' => '巴真' 
						),
						2291000 => array (
								'province' => '巴蜀' 
						),
						2293000 => array (
								'province' => '孔敬' 
						),
						2292400 => array (
								'province' => '甘烹碧' 
						),
						2292800 => array (
								'province' => '甲米' 
						),
						2292700 => array (
								'province' => '加拉信' 
						),
						2296400 => array (
								'province' => '四色菊' 
						),
						2290600 => array (
								'province' => '北大年' 
						),
						2290800 => array (
								'province' => '北柳' 
						),
						2290300 => array (
								'province' => '北碧' 
						),
						2290200 => array (
								'province' => '北標' 
						),
						2290700 => array (
								'province' => '北攬' 
						),
						2290900 => array (
								'province' => '北欖坡' 
						),
						2293600 => array (
								'province' => '叻丕' 
						),
						2292900 => array (
								'province' => '尖竹汶' 
						),
						2294500 => array (
								'province' => '那空那育' 
						),
						2294600 => array (
								'province' => '那空帕農' 
						),
						2295700 => array (
								'province' => '色軍' 
						),
						2290100 => array (
								'province' => '安納乍能' 
						),
						2295600 => array (
								'province' => '沙敦' 
						),
						2295800 => array (
								'province' => '沙繳' 
						),
						2292200 => array (
								'province' => '佛丕' 
						),
						2292300 => array (
								'province' => '佛統' 
						),
						2296300 => array (
								'province' => '宋卡' 
						),
						2297400 => array (
								'province' => '耶梭通' 
						),
						2297200 => array (
								'province' => '夜功' 
						),
						2297100 => array (
								'province' => '夜豐頌' 
						),
						2294800 => array (
								'province' => '帕' 
						),
						2295200 => array (
								'province' => '帕堯' 
						),
						2295000 => array (
								'province' => '披集' 
						),
						2293500 => array (
								'province' => '拉農' 
						),
						2296700 => array (
								'province' => '武裏南' 
						),
						2292600 => array (
								'province' => '紅統' 
						),
						2293300 => array (
								'province' => '洛坤' 
						),
						2291500 => array (
								'province' => '春武裏' 
						),
						2291400 => array (
								'province' => '春蓬' 
						),
						2294400 => array (
								'province' => '南奔' 
						),
						2297000 => array (
								'province' => '信武裏' 
						),
						2296900 => array (
								'province' => '烏汶' 
						),
						2296800 => array (
								'province' => '烏泰他尼' 
						),
						2296600 => array (
								'province' => '烏隆' 
						),
						2295900 => array (
								'province' => '素可泰' 
						),
						2296100 => array (
								'province' => '素叻' 
						),
						2296000 => array (
								'province' => '素林' 
						),
						2296200 => array (
								'province' => '素攀武裏' 
						),
						2296500 => array (
								'province' => '陶公' 
						),
						2294000 => array (
								'province' => '莫達漢' 
						),
						2292500 => array (
								'province' => '華富裏' 
						),
						2295400 => array (
								'province' => '清萊' 
						),
						2295500 => array (
								'province' => '清邁' 
						),
						2293400 => array (
								'province' => '廊莫那浦' 
						),
						2293200 => array (
								'province' => '廊開' 
						),
						2294100 => array (
								'province' => '曼谷' 
						),
						2291700 => array (
								'province' => '猜也奔' 
						),
						2291300 => array (
								'province' => '猜那' 
						),
						2291800 => array (
								'province' => '達' 
						),
						2292100 => array (
								'province' => '達叻' 
						),
						2292000 => array (
								'province' => '董裏' 
						),
						2291600 => array (
								'province' => '程逸' 
						),
						2294900 => array (
								'province' => '普吉' 
						),
						2290500 => array (
								'province' => '博達倫' 
						),
						2295100 => array (
								'province' => '彭世洛' 
						),
						2294700 => array (
								'province' => '暖武裏' 
						),
						2294200 => array (
								'province' => '瑪哈沙拉堪' 
						),
						2290400 => array (
								'province' => '碧差汶' 
						),
						2293100 => array (
								'province' => '黎' 
						),
						2293800 => array (
								'province' => '黎逸' 
						),
						2293900 => array (
								'province' => '龍仔厝' 
						),
						2295300 => array (
								'province' => '攀牙' 
						),
						2294300 => array (
								'province' => '難' 
						),
						2293700 => array (
								'province' => '羅勇' 
						) 
				) 
		),
		2030000 => array (
				'country' => '納米比亞' 
		),
		1750000 => array (
				'country' => '留尼旺島' 
		),
		1540000 => array (
				'country' => '海地' 
		),
		1960000 => array (
				'country' => '馬其頓' 
		),
		1930000 => array (
				'country' => '馬拉維' 
		),
		1940000 => array (
				'country' => '馬來西亞',
				'provinces' => array (
						1940300 => array (
								'province' => '丁加奴',
								'citys' => array (
										1940307 => '勿述',
										1940301 => '瓜拉丁加奴',
										1940302 => '甘馬挽',
										1940306 => '烏魯',
										1940304 => '馬江',
										1940305 => '實兆',
										1940303 => '龍運' 
								) 
						),
						1940400 => array (
								'province' => '吉打',
								'citys' => array (
										1940401 => '巴東得臘',
										1940406 => '瓜拉姆達',
										1940404 => '古邦巴素',
										1940408 => '居林',
										1940405 => '哥打士打',
										1940403 => '浮羅交怡',
										1940407 => '華玲',
										1940402 => '笨筒',
										1940409 => '萬拉峇魯' 
								) 
						),
						1940600 => array (
								'province' => '吉隆玻',
								'citys' => array (
										1940601 => '吉隆玻' 
								) 
						),
						1940500 => array (
								'province' => '吉蘭丹',
								'citys' => array (
										1940510 => '日裏',
										1940502 => '巴西馬',
										1940501 => '巴西富地',
										1940504 => '丹那美拉',
										1940507 => '瓜拉吉賴',
										1940506 => '哥打巴魯',
										1940509 => '馬樟',
										1940503 => '道北',
										1940505 => '登卓',
										1940508 => '話望生' 
								) 
						),
						1941200 => array (
								'province' => '沙巴',
								'citys' => array (
										1941221 => '山打根',
										1941207 => '斗湖',
										1941208 => '丹南',
										1941204 => '比魯蘭',
										1941215 => '瓜拉班尤',
										1941222 => '仙本那',
										1941202 => '必達士',
										1941212 => '古打毛律',
										1941216 => '古納',
										1941210 => '古達',
										1941223 => '西比陶',
										1941201 => '吧巴',
										1941205 => '兵南邦',
										1941217 => '京那巴登岸',
										1941203 => '保佛',
										1941214 => '根地咬',
										1941213 => '哥打馬魯都',
										1941211 => '哥打基納巴魯',
										1941219 => '納巴灣',
										1941220 => '拿篤',
										1941209 => '鬥亞蘭',
										1941206 => '擔布南',
										1941218 => '蘭腦' 
								) 
						),
						1941300 => array (
								'province' => '沙撈越',
								'citys' => array (
										1941310 => '三馬拉漢',
										1941307 => '木中',
										1941305 => '木膠',
										1941304 => '民都魯',
										1941302 => '加帛',
										1941301 => '古晉',
										1941311 => '泗務',
										1941309 => '泗裏街',
										1941303 => '林夢',
										1941306 => '美裏',
										1941308 => '斯裏阿曼' 
								) 
						),
						1940100 => array (
								'province' => '玻璃市? ? ?',
								'citys' => array (
										1940101 => '加央' 
								) 
						),
						1941100 => array (
								'province' => '柔佛',
								'citys' => array (
										1941104 => '居鑾',
										1941106 => '昔加末',
										1941108 => '峇株巴轄',
										1941107 => '柔佛巴魯',
										1941103 => '哥打丁宜',
										1941105 => '麻坡',
										1941101 => '笨珍',
										1941102 => '豐盛港' 
								) 
						),
						1940800 => array (
								'province' => '納閩',
								'citys' => array (
										1940801 => '納閩',
										1940802 => '維多利亞' 
								) 
						),
						1940700 => array (
								'province' => '麻六甲',
								'citys' => array (
										1940702 => '亞羅牙也',
										1940703 => '野新',
										1940701 => '麻六甲市' 
								) 
						),
						1941500 => array (
								'province' => '雪蘭莪',
								'citys' => array (
										1941501 => '八打靈',
										1941503 => '瓜拉冷嶽',
										1941504 => '瓜拉雪蘭莪',
										1941505 => '沙白安南',
										1941506 => '烏魯冷嶽',
										1941507 => '烏魯雪蘭莪',
										1941508 => '雪邦',
										1941502 => '鵝麥' 
								) 
						),
						1941400 => array (
								'province' => '森美蘭',
								'citys' => array (
										1941407 => '日叻務',
										1941406 => '仁保',
										1941404 => '瓜拉庇勞',
										1941403 => '芙蓉',
										1941401 => '波德申',
										1941405 => '林茂',
										1941402 => '淡邊' 
								) 
						),
						1940900 => array (
								'province' => '彭亨',
								'citys' => array (
										1940910 => '文冬',
										1940907 => '立卑',
										1940901 => '北根',
										1940904 => '而連突',
										1940902 => '百樂',
										1940906 => '金馬侖高原',
										1940909 => '馬蘭',
										1940903 => '淡馬魯',
										1940908 => '勞勿',
										1940911 => '雲冰',
										1940905 => '關丹' 
								) 
						),
						1940200 => array (
								'province' => '檳榔嶼',
								'citys' => array (
										1940203 => '大山腳',
										1940202 => '北海',
										1940204 => '高淵',
										1940201 => '檳城' 
								) 
						),
						1941000 => array (
								'province' => '霹靂',
								'citys' => array (
										1941007 => '太平',
										1941002 => '丹絨馬',
										1941005 => '江沙',
										1941001 => '安順',
										1941008 => '怡保',
										1941004 => '和豐',
										1941006 => '紅土坎',
										1941003 => '華都牙也' 
								) 
						) 
				) 
		),
		1980000 => array (
				'country' => '馬紹爾群島' 
		),
		1830000 => array (
				'country' => '馬達加斯加' 
		),
		1840000 => array (
				'country' => '馬爾代夫',
				'provinces' => array (
						1840600 => array (
								'province' => '北尼蘭杜' 
						),
						1840400 => array (
								'province' => '北米拉杜馬杜盧' 
						),
						1840200 => array (
								'province' => '北阿裏' 
						),
						1840500 => array (
								'province' => '北馬婁斯馬杜盧' 
						),
						1840300 => array (
								'province' => '北蒂拉杜馬蒂' 
						),
						1840700 => array (
								'province' => '北蘇瓦迪瓦' 
						),
						1840100 => array (
								'province' => '阿杜' 
						),
						1840900 => array (
								'province' => '法狄福盧' 
						),
						1841100 => array (
								'province' => '哈杜馬蒂' 
						),
						1841200 => array (
								'province' => '科盧馬杜盧' 
						),
						1842000 => array (
								'province' => '南尼蘭杜' 
						),
						1841800 => array (
								'province' => '南米拉杜馬杜盧' 
						),
						1841600 => array (
								'province' => '南阿裏' 
						),
						1841900 => array (
								'province' => '南馬婁斯馬杜盧' 
						),
						1841700 => array (
								'province' => '南蒂拉杜馬蒂' 
						),
						1842100 => array (
								'province' => '南蘇瓦迪瓦' 
						),
						1841300 => array (
								'province' => '馬累' 
						),
						1841400 => array (
								'province' => '馬累島' 
						),
						1841000 => array (
								'province' => '費利杜' 
						),
						1840800 => array (
								'province' => '福阿穆拉庫' 
						),
						1841500 => array (
								'province' => '穆拉庫' 
						) 
				) 
		),
		1890000 => array (
				'country' => '秘魯' 
		),
		1490000 => array (
				'country' => '剛果民主共和國' 
		),
		2320000 => array (
				'country' => '特立尼達和多巴哥' 
		),
		1570000 => array (
				'country' => '荷蘭',
				'provinces' => array (
						1571000 => array (
								'province' => '布雷達' 
						),
						1572200 => array (
								'province' => '米德爾堡' 
						),
						1571100 => array (
								'province' => '多德雷赫特' 
						),
						1571900 => array (
								'province' => '呂戈登' 
						),
						1570500 => array (
								'province' => '阿姆斯特丹' 
						),
						1570700 => array (
								'province' => '阿珀爾多倫' 
						),
						1570600 => array (
								'province' => '阿納姆' 
						),
						1570800 => array (
								'province' => '阿森' 
						),
						1570200 => array (
								'province' => '阿爾梅勒' 
						),
						1570400 => array (
								'province' => '阿默斯福特' 
						),
						1572700 => array (
								'province' => '佐特爾梅' 
						),
						1572400 => array (
								'province' => '奈梅亨' 
						),
						1571600 => array (
								'province' => '哈勒姆' 
						),
						1572800 => array (
								'province' => '茲沃勒' 
						),
						1571400 => array (
								'province' => '格羅寧根' 
						),
						1571300 => array (
								'province' => '恩斯赫德' 
						),
						1572600 => array (
								'province' => '烏德勒支' 
						),
						1571700 => array (
								'province' => '海牙' 
						),
						1572300 => array (
								'province' => '馬斯特里赫特' 
						),
						1570900 => array (
								'province' => '埃因霍芬' 
						),
						1570300 => array (
								'province' => '埃門' 
						),
						1570100 => array (
								'province' => '埃德' 
						),
						1572000 => array (
								'province' => '萊利斯塔德' 
						),
						1571800 => array (
								'province' => '萊頓' 
						),
						1572100 => array (
								'province' => '鹿特丹' 
						),
						1571200 => array (
								'province' => '蒂爾堡' 
						),
						1572500 => array (
								'province' => '斯海爾托亨博思' 
						),
						1571500 => array (
								'province' => '霍夫多爾普' 
						) 
				) 
		),
		1970000 => array (
				'country' => '莫三比克' 
		),
		1850000 => array (
				'country' => '莫爾達瓦' 
		),
		1080000 => array (
				'country' => '埃及' 
		),
		1130000 => array (
				'country' => '埃塞俄比亞' 
		),
		1770000 => array (
				'country' => '萊索托' 
		),
		1610000 => array (
				'country' => '捷克共和國' 
		),
		1440000 => array (
				'country' => '菲律賓',
				'provinces' => array (
						1440300 => array (
								'province' => '卡盧坎' 
						),
						1440200 => array (
								'province' => '馬尼拉' 
						),
						1440400 => array (
								'province' => '宿務' 
						),
						1440100 => array (
								'province' => '達沃' 
						) 
				) 
		),
		1620000 => array (
				'country' => '基裏巴斯' 
		),
		2550000 => array (
				'country' => '葉門' 
		),
		2310000 => array (
				'country' => '塔吉克斯坦' 
		),
		2070000 => array (
				'country' => '葡萄牙',
				'provinces' => array (
						2072000 => array (
								'province' => '山后' 
						),
						2071900 => array (
								'province' => '上阿連特茹' 
						),
						2072200 => array (
								'province' => '上特拉斯山' 
						),
						2072700 => array (
								'province' => '下伏日' 
						),
						2072500 => array (
								'province' => '下阿連特茹' 
						),
						2072800 => array (
								'province' => '下蒙德古' 
						),
						2071500 => array (
								'province' => '內皮尼亞爾北' 
						),
						2071600 => array (
								'province' => '內皮尼亞爾南' 
						),
						2071300 => array (
								'province' => '內貝拉北' 
						),
						2071400 => array (
								'province' => '內貝拉南' 
						),
						2072900 => array (
								'province' => '中阿連特茹' 
						),
						2071800 => array (
								'province' => '卡瓦多' 
						),
						2071200 => array (
								'province' => '米尼奧-利馬' 
						),
						2072600 => array (
								'province' => '西部' 
						),
						2071000 => array (
								'province' => '里斯本' 
						),
						2070900 => array (
								'province' => '利巴特茹' 
						),
						2070400 => array (
								'province' => '杜羅' 
						),
						2070600 => array (
								'province' => '法魯' 
						),
						2070100 => array (
								'province' => '波爾圖' 
						),
						2070800 => array (
								'province' => '科瓦貝拉' 
						),
						2070500 => array (
								'province' => '恩特拉杜羅伏日' 
						),
						2071100 => array (
								'province' => '梅地奧特茹' 
						),
						2072400 => array (
								'province' => '萬福' 
						),
						2072300 => array (
								'province' => '塔梅加' 
						),
						2072100 => array (
								'province' => '塞圖巴爾半島' 
						),
						2071700 => array (
								'province' => '蓬塔德爾加達' 
						),
						2070300 => array (
								'province' => '濱海皮尼亞爾' 
						),
						2070200 => array (
								'province' => '濱海阿連特茹' 
						),
						2070700 => array (
								'province' => '豐沙爾' 
						) 
				) 
		),
		1670000 => array (
				'country' => '喀麥隆' 
		),
		2580000 => array (
				'country' => '越南',
				'provinces' => array (
						2580200 => array (
								'province' => '河內' 
						),
						2580300 => array (
								'province' => '胡志明市' 
						),
						2580100 => array (
								'province' => '海防' 
						) 
				) 
		),
		1680000 => array (
				'country' => '開曼群島' 
		),
		1420000 => array (
				'country' => '斐濟' 
		),
		2090000 => array (
				'country' => '喬治亞' 
		),
		2180000 => array (
				'country' => '斯里蘭卡' 
		),
		2210000 => array (
				'country' => '斯洛文尼亞' 
		),
		2160000 => array (
				'country' => '斯洛伐克' 
		),
		2270000 => array (
				'country' => '斯威士蘭' 
		),
		2300000 => array (
				'country' => '湯加' 
		),
		2670000 => array (
				'country' => '智利' 
		),
		1340000 => array (
				'country' => '朝鮮' 
		),
		1170000 => array (
				'country' => '博茨瓦納' 
		),
		2220000 => array (
				'country' => '聖馬力諾' 
		),
		2150000 => array (
				'country' => '聖基茨和尼維斯' 
		),
		2120000 => array (
				'country' => '瑞士',
				'provinces' => array (
						2122000 => array (
								'province' => '上瓦爾登' 
						),
						2122700 => array (
								'province' => '下瓦爾登' 
						),
						2122500 => array (
								'province' => '瓦萊' 
						),
						2121100 => array (
								'province' => '內阿彭策爾' 
						),
						2121400 => array (
								'province' => '日內瓦' 
						),
						2120300 => array (
								'province' => '巴塞尔' 
						),
						2120400 => array (
								'province' => '巴塞爾鄉村' 
						),
						2122400 => array (
								'province' => '外阿彭策爾' 
						),
						2120600 => array (
								'province' => '弗裏堡' 
						),
						2121300 => array (
								'province' => '汝拉' 
						),
						2122300 => array (
								'province' => '沃' 
						),
						2121500 => array (
								'province' => '沙夫豪森' 
						),
						2120100 => array (
								'province' => '阿爾高' 
						),
						2120200 => array (
								'province' => '伯爾尼' 
						),
						2120900 => array (
								'province' => '洛桑' 
						),
						2121900 => array (
								'province' => '施維茨' 
						),
						2120800 => array (
								'province' => '格拉魯斯' 
						),
						2120700 => array (
								'province' => '格勞賓登' 
						),
						2122600 => array (
								'province' => '烏裏' 
						),
						2121200 => array (
								'province' => '納沙泰爾' 
						),
						2121800 => array (
								'province' => '索洛圖恩' 
						),
						2122200 => array (
								'province' => '提契諾' 
						),
						2121600 => array (
								'province' => '聖加侖' 
						),
						2120500 => array (
								'province' => '楚格' 
						),
						2122100 => array (
								'province' => '圖爾高' 
						),
						2121000 => array (
								'province' => '盧塞恩' 
						),
						2121700 => array (
								'province' => '蘇黎世' 
						) 
				) 
		),
		2240000 => array (
				'country' => '塞內加爾' 
		),
		2250000 => array (
				'country' => '塞舌耳' 
		),
		2110000 => array (
				'country' => '瑞典',
				'provinces' => array (
						2110500 => array (
								'province' => '厄勒布魯' 
						),
						2110200 => array (
								'province' => '布萊金厄' 
						),
						2110100 => array (
								'province' => '北博滕' 
						),
						2111000 => array (
								'province' => '卡爾馬' 
						),
						2111800 => array (
								'province' => '西約特蘭' 
						),
						2111600 => array (
								'province' => '西曼蘭' 
						),
						2111500 => array (
								'province' => '西博滕' 
						),
						2111700 => array (
								'province' => '西諾爾蘭' 
						),
						2112100 => array (
								'province' => '延雪平' 
						),
						2110800 => array (
								'province' => '克魯努貝裏' 
						),
						2111900 => array (
								'province' => '耶夫勒堡' 
						),
						2112000 => array (
								'province' => '耶姆特蘭' 
						),
						2110400 => array (
								'province' => '東約特蘭' 
						),
						2110700 => array (
								'province' => '哈蘭' 
						),
						2110900 => array (
								'province' => '南曼蘭' 
						),
						2111300 => array (
								'province' => '韋姆蘭' 
						),
						2111400 => array (
								'province' => '烏普薩拉' 
						),
						2110600 => array (
								'province' => '哥得蘭' 
						),
						2110300 => array (
								'province' => '達拉納' 
						),
						2111200 => array (
								'province' => '斯科耐' 
						),
						2111100 => array (
								'province' => '斯德哥爾摩' 
						) 
				) 
		),
		2170000 => array (
				'country' => '塞拉里昂' 
		),
		2140000 => array (
				'country' => '塞爾維亞,黑山' 
		),
		1860000 => array (
				'country' => '蒙古' 
		),
		1050000 => array (
				'country' => '愛爾蘭',
				'provinces' => array (
						1052100 => array (
								'province' => '卡洛' 
						),
						1052000 => array (
								'province' => '卡範' 
						),
						1051900 => array (
								'province' => '米斯' 
						),
						1050300 => array (
								'province' => '多內加爾' 
						),
						1052600 => array (
								'province' => '西米斯' 
						),
						1052500 => array (
								'province' => '沃特福德 ?' 
						),
						1051000 => array (
								'province' => '克雷爾' 
						),
						1051600 => array (
								'province' => '利特裏姆' 
						),
						1051200 => array (
								'province' => '利默里克' 
						),
						1050800 => array (
								'province' => '科克' 
						),
						1052300 => array (
								'province' => '威克洛' 
						),
						1052400 => array (
								'province' => '韋克斯福德?' 
						),
						1050500 => array (
								'province' => '哥爾韋' 
						),
						1050200 => array (
								'province' => '都柏林' 
						),
						1051100 => array (
								'province' => '朗福德' 
						),
						1051800 => array (
								'province' => '莫內根' 
						),
						1051700 => array (
								'province' => '梅奧' 
						),
						1050600 => array (
								'province' => '基爾代爾' 
						),
						1050700 => array (
								'province' => '基爾肯尼' 
						),
						1050400 => array (
								'province' => '蒂珀雷裏' 
						),
						1052200 => array (
								'province' => '斯萊戈' 
						),
						1050900 => array (
								'province' => '凱裏' 
						),
						1051300 => array (
								'province' => '勞斯' 
						),
						1050100 => array (
								'province' => '奧法利' 
						),
						1051400 => array (
								'province' => '嶗斯' 
						),
						1051500 => array (
								'province' => '羅斯康芒?' 
						) 
				) 
		),
		2430000 => array (
				'country' => '新加坡' 
		),
		2460000 => array (
				'country' => '新西蘭',
				'provinces' => array (
						2462200 => array (
								'province' => '瓦卡塔尼' 
						),
						2461700 => array (
								'province' => '內皮爾' 
						),
						2460300 => array (
								'province' => '布萊尼姆' 
						),
						2460200 => array (
								'province' => '北岸' 
						),
						2460400 => array (
								'province' => '北帕默斯頓' 
						),
						2460500 => array (
								'province' => '北遠' 
						),
						2461100 => array (
								'province' => '吉斯伯恩' 
						),
						2462400 => array (
								'province' => '因弗卡吉耳' 
						),
						2461200 => array (
								'province' => '克賴斯特徹奇' 
						),
						2461400 => array (
								'province' => '里士滿' 
						),
						2462000 => array (
								'province' => '旺阿雷' 
						),
						2462100 => array (
								'province' => '旺格努伊' 
						),
						2460800 => array (
								'province' => '哈密爾頓' 
						),
						2460700 => array (
								'province' => '格雷茅斯' 
						),
						2461600 => array (
								'province' => '納爾遜' 
						),
						2461500 => array (
								'province' => '馬努考' 
						),
						2461900 => array (
								'province' => '陶馬魯努伊' 
						),
						2460600 => array (
								'province' => '達尼丁' 
						),
						2461800 => array (
								'province' => '斯特拉特福德' 
						),
						2461300 => array (
								'province' => '凱帕拉' 
						),
						2462300 => array (
								'province' => '新普利茅斯' 
						),
						2460100 => array (
								'province' => '奧克蘭' 
						),
						2460900 => array (
								'province' => '赫斯廷斯' 
						),
						2461000 => array (
								'province' => '懷塔柯拉' 
						) 
				) 
		),
		2440000 => array (
				'country' => '新赫里多尼亞' 
		),
		2500000 => array (
				'country' => '義大利',
				'provinces' => array (
						2500900 => array (
								'province' => '巴里' 
						),
						2501200 => array (
								'province' => '巴勒莫' 
						),
						2501600 => array (
								'province' => '比薩' 
						),
						2501000 => array (
								'province' => '布拉' 
						),
						2501100 => array (
								'province' => '布林迪西' 
						),
						2504800 => array (
								'province' => '卡利亞里' 
						),
						2505100 => array (
								'province' => '卡坦紮羅' 
						),
						2505000 => array (
								'province' => '卡塔尼亞' 
						),
						2504900 => array (
								'province' => '卡塞塔' 
						),
						2503700 => array (
								'province' => '米蘭' 
						),
						2504300 => array (
								'province' => '那不勒斯' 
						),
						2506600 => array (
								'province' => '伊塞爾尼亞' 
						),
						2500200 => array (
								'province' => '安科納' 
						),
						2501500 => array (
								'province' => '貝內文托' 
						),
						2500800 => array (
								'province' => '貝加莫' 
						),
						2502400 => array (
								'province' => '克羅托內' 
						),
						2500500 => array (
								'province' => '阿斯科利皮切諾' 
						),
						2500400 => array (
								'province' => '阿斯蒂' 
						),
						2504200 => array (
								'province' => '努奧羅' 
						),
						2501400 => array (
								'province' => '佈雷西亞' 
						),
						2502300 => array (
								'province' => '坎波巴索' 
						),
						2502200 => array (
								'province' => '佛羅倫斯' 
						),
						2500700 => array (
								'province' => '波代諾內' 
						),
						2501700 => array (
								'province' => '波坦察' 
						),
						2504700 => array (
								'province' => '帕維亞' 
						),
						2504500 => array (
								'province' => '帕爾馬' 
						),
						2501900 => array (
								'province' => '的里雅斯特' 
						),
						2506500 => array (
								'province' => '亞歷山德里亞' 
						),
						2503100 => array (
								'province' => '拉奎拉' 
						),
						2503400 => array (
								'province' => '拉斯佩齊亞' 
						),
						2504600 => array (
								'province' => '佩魯賈' 
						),
						2502700 => array (
								'province' => '科森紮' 
						),
						2502500 => array (
								'province' => '科摩' 
						),
						2506100 => array (
								'province' => '威尼斯' 
						),
						2506000 => array (
								'province' => '韋爾切利' 
						),
						2505900 => array (
								'province' => '烏迪內' 
						),
						2501800 => array (
								'province' => '都靈' 
						),
						2503900 => array (
								'province' => '馬泰拉' 
						),
						2503800 => array (
								'province' => '馬薩' 
						),
						2505600 => array (
								'province' => '特拉帕尼' 
						),
						2505700 => array (
								'province' => '特倫托' 
						),
						2502600 => array (
								'province' => '庫內奧' 
						),
						2503300 => array (
								'province' => '萊切' 
						),
						2503000 => array (
								'province' => '萊科' 
						),
						2505800 => array (
								'province' => '塔蘭托' 
						),
						2502100 => array (
								'province' => '費拉拉' 
						),
						2501300 => array (
								'province' => '博洛尼亞' 
						),
						2504100 => array (
								'province' => '蒙紮' 
						),
						2503500 => array (
								'province' => '裏窩那' 
						),
						2502000 => array (
								'province' => '福賈' 
						),
						2502800 => array (
								'province' => '雷焦艾米利亞' 
						),
						2502900 => array (
								'province' => '雷焦卡拉布裏亞' 
						),
						2500600 => array (
								'province' => '奧斯塔' 
						),
						2500300 => array (
								'province' => '奧裏斯塔諾' 
						),
						2500100 => array (
								'province' => '奧爾比亞' 
						),
						2506200 => array (
								'province' => '維泰博' 
						),
						2503600 => array (
								'province' => '摩德納' 
						),
						2504000 => array (
								'province' => '墨西拿' 
						),
						2505200 => array (
								'province' => '熱那亞' 
						),
						2504400 => array (
								'province' => '諾瓦拉' 
						),
						2505500 => array (
								'province' => '薩沃納' 
						),
						2505300 => array (
								'province' => '薩萊諾' 
						),
						2505400 => array (
								'province' => '薩薩里' 
						),
						2506400 => array (
								'province' => '錫耶納' 
						),
						2506300 => array (
								'province' => '錫拉庫紮' 
						),
						2503200 => array (
								'province' => '羅馬' 
						) 
				) 
		),
		1010000 => array (
				'country' => '奧地利',
				'provinces' => array (
						1010500 => array (
								'province' => '上奧地利' 
						),
						1010900 => array (
								'province' => '下奧地利' 
						),
						1010100 => array (
								'province' => '布林根蘭' 
						),
						1010400 => array (
								'province' => '克恩頓' 
						),
						1010600 => array (
								'province' => '施蒂利亞' 
						),
						1010200 => array (
								'province' => '蒂羅爾' 
						),
						1010300 => array (
								'province' => '福拉爾貝格' 
						),
						1010800 => array (
								'province' => '維也納' 
						),
						1010700 => array (
								'province' => '薩爾茨堡' 
						) 
				) 
		),
		1900000 => array (
				'country' => '摩洛哥' 
		),
		1950000 => array (
				'country' => '摩納哥' 
		),
		1990000 => array (
				'country' => '墨西哥',
				'provinces' => array (
						1995600 => array (
								'province' => '瓦哈卡' 
						),
						1990900 => array (
								'province' => '贝尼托·胡亚雷斯' 
						),
						1991100 => array (
								'province' => '巴亞爾塔港' 
						),
						1990700 => array (
								'province' => '巴厘城' 
						),
						1994100 => array (
								'province' => '切圖馬爾' 
						),
						1990800 => array (
								'province' => '比利亞埃爾莫薩' 
						),
						1991600 => array (
								'province' => '瓜納華托' 
						),
						1991500 => array (
								'province' => '瓜達拉哈拉' 
						),
						1993700 => array (
								'province' => '布埃布拉' 
						),
						1994000 => array (
								'province' => '卡門' 
						),
						1994900 => array (
								'province' => '托雷翁' 
						),
						1994700 => array (
								'province' => '托盧卡' 
						),
						1996000 => array (
								'province' => '伊拉普阿托' 
						),
						1990100 => array (
								'province' => '克夫雷貢城' 
						),
						1992300 => array (
								'province' => '克雷塔羅' 
						),
						1990200 => array (
								'province' => '阿瓜斯卡連斯特' 
						),
						1990600 => array (
								'province' => '阿卡普爾科' 
						),
						1991300 => array (
								'province' => '杜蘭戈' 
						),
						1991000 => array (
								'province' => '波薩裏卡' 
						),
						1994200 => array (
								'province' => '奇瓦瓦' 
						),
						1993900 => array (
								'province' => '奇爾潘辛戈' 
						),
						1993800 => array (
								'province' => '帕丘卡' 
						),
						1992500 => array (
								'province' => '拉巴斯' 
						),
						1995100 => array (
								'province' => '坦皮科' 
						),
						1991700 => array (
								'province' => '哈拉帕' 
						),
						1992700 => array (
								'province' => '洛斯莫奇斯' 
						),
						1992200 => array (
								'province' => '科利馬' 
						),
						1995800 => array (
								'province' => '韋拉克魯斯' 
						),
						1991400 => array (
								'province' => '恩塞納達' 
						),
						1995700 => array (
								'province' => '烏盧阿潘' 
						),
						1993300 => array (
								'province' => '馬塔莫羅斯' 
						),
						1993100 => array (
								'province' => '馬薩特蘭' 
						),
						1995400 => array (
								'province' => '特瓦坎' 
						),
						1995000 => array (
								'province' => '特皮克' 
						),
						1994800 => array (
								'province' => '特拉斯卡拉' 
						),
						1992100 => array (
								'province' => '庫利阿坎' 
						),
						1991900 => array (
								'province' => '庫埃納瓦卡' 
						),
						1993000 => array (
								'province' => '莫雷裏亞' 
						),
						1990500 => array (
								'province' => '埃佩切' 
						),
						1990400 => array (
								'province' => '埃莫西約' 
						),
						1991800 => array (
								'province' => '華雷斯' 
						),
						1992400 => array (
								'province' => '萊昂' 
						),
						1992900 => array (
								'province' => '梅裏達' 
						),
						1995200 => array (
								'province' => '塔帕丘拉' 
						),
						1991200 => array (
								'province' => '蒂華納' 
						),
						1994500 => array (
								'province' => '聖路易士波托亞' 
						),
						1994400 => array (
								'province' => '塞拉亞' 
						),
						1992800 => array (
								'province' => '蒙克洛瓦' 
						),
						1993200 => array (
								'province' => '蒙特雷' 
						),
						1995900 => array (
								'province' => '新拉雷多' 
						),
						1992000 => array (
								'province' => '誇察誇拉克斯' 
						),
						1992600 => array (
								'province' => '雷諾薩' 
						),
						1990300 => array (
								'province' => '奧裏薩巴' 
						),
						1995500 => array (
								'province' => '維多利亞城' 
						),
						1995300 => array (
								'province' => '圖斯特拉-古鐵雷斯' 
						),
						1993500 => array (
								'province' => '墨西卡裏' 
						),
						1993400 => array (
								'province' => '墨西哥城' 
						),
						1993600 => array (
								'province' => '諾加萊斯' 
						),
						1994600 => array (
								'province' => '薩卡特卡斯' 
						),
						1994300 => array (
								'province' => '薩爾蒂約' 
						) 
				) 
		),
		1820000 => array (
				'country' => '緬甸' 
		),
		1720000 => array (
				'country' => '黎巴嫩' 
		),
		1020000 => array (
				'country' => '澳大利亞',
				'provinces' => array (
						1020100 => array (
								'province' => '北部地方',
								'citys' => array (
										1020101 => '北帕默斯頓',
										1020102 => '達爾文' 
								) 
						),
						1020700 => array (
								'province' => '西澳大利亞',
								'citys' => array (
										1020703 => '弗裏曼特爾港',
										1020707 => '卡爾古利',
										1020706 => '珀斯',
										1020702 => '班伯里',
										1020705 => '曼哲拉',
										1020704 => '傑拉爾頓',
										1020701 => '奧爾巴尼' 
								) 
						),
						1020200 => array (
								'province' => '坎培拉' 
						),
						1020300 => array (
								'province' => '昆士蘭',
								'citys' => array (
										1020301 => '布里斯班',
										1020304 => '卡羅旺德拉',
										1020302 => '黃金海岸',
										1020303 => '凱恩斯',
										1020305 => '湯斯維爾',
										1020306 => '圖文巴' 
								) 
						),
						1020400 => array (
								'province' => '南澳大利亞',
								'citys' => array (
										1020403 => '甘比亞山',
										1020407 => '皮里港',
										1020401 => '阿德萊德',
										1020405 => '林肯港',
										1020402 => '奧古斯塔',
										1020408 => '維克托港',
										1020406 => '默里布裏奇',
										1020404 => '懷阿拉' 
								) 
						),
						1020500 => array (
								'province' => '塔斯馬尼亞',
								'citys' => array (
										1020501 => '伯尼港',
										1020504 => '朗塞斯頓',
										1020502 => '德文波特',
										1020503 => '霍巴特' 
								) 
						),
						1020800 => array (
								'province' => '新南威爾士',
								'citys' => array (
										1020802 => '伍倫貢',
										1020801 => '紐卡斯爾',
										1020803 => '悉尼' 
								) 
						),
						1020600 => array (
								'province' => '維多利亞',
								'citys' => array (
										1020601 => '吉朗',
										1020602 => '墨爾本' 
								) 
						) 
				) 
		),
		2640000 => array (
				'country' => '澳門',
				'provinces' => array (
						2640100 => array (
								'province' => '大堂区' 
						),
						2640300 => array (
								'province' => '风顺堂区' 
						),
						2640200 => array (
								'province' => '氹仔' 
						),
						2640600 => array (
								'province' => '圣安多尼堂区' 
						),
						2640400 => array (
								'province' => '花地玛堂区' 
						),
						2640700 => array (
								'province' => '望德堂区' 
						),
						2640500 => array (
								'province' => '路环岛' 
						) 
				) 
		),
		1350000 => array (
				'country' => '德國',
				'provinces' => array (
						1350900 => array (
								'province' => '不來梅' 
						),
						1353900 => array (
								'province' => '什未林' 
						),
						1350800 => array (
								'province' => '比勒費爾德' 
						),
						1351000 => array (
								'province' => '布勞恩斯魏克' 
						),
						1351600 => array (
								'province' => '代特莫爾特' 
						),
						1351700 => array (
								'province' => '弗賴堡' 
						),
						1353700 => array (
								'province' => '卡塞爾' 
						),
						1353600 => array (
								'province' => '卡爾斯魯厄' 
						),
						1352300 => array (
								'province' => '吉森' 
						),
						1350400 => array (
								'province' => '安斯巴格' 
						),
						1352900 => array (
								'province' => '呂訥堡' 
						),
						1350200 => array (
								'province' => '阿恩斯貝格' 
						),
						1351500 => array (
								'province' => '杜塞爾多夫' 
						),
						1351800 => array (
								'province' => '法蘭克福' 
						),
						1350500 => array (
								'province' => '波茨坦' 
						),
						1350600 => array (
								'province' => '波鴻' 
						),
						1353300 => array (
								'province' => '明斯特' 
						),
						1352000 => array (
								'province' => '哈雷' 
						),
						1352400 => array (
								'province' => '科布倫次' 
						),
						1352500 => array (
								'province' => '科隆' 
						),
						1354200 => array (
								'province' => '威斯巴登' 
						),
						1351100 => array (
								'province' => '拜伊羅特' 
						),
						1353400 => array (
								'province' => '美因茲' 
						),
						1350700 => array (
								'province' => '柏林' 
						),
						1353500 => array (
								'province' => '紐倫堡' 
						),
						1353000 => array (
								'province' => '馬格德堡' 
						),
						1354000 => array (
								'province' => '特里爾' 
						),
						1352700 => array (
								'province' => '萊比錫' 
						),
						1353100 => array (
								'province' => '曼海姆' 
						),
						1352200 => array (
								'province' => '基爾' 
						),
						1351300 => array (
								'province' => '達姆施塔特' 
						),
						1352600 => array (
								'province' => '開姆尼斯' 
						),
						1353800 => array (
								'province' => '斯圖加特' 
						),
						1350100 => array (
								'province' => '愛爾福特' 
						),
						1353200 => array (
								'province' => '慕尼克' 
						),
						1350300 => array (
								'province' => '奧格斯堡' 
						),
						1354100 => array (
								'province' => '維爾茨堡' 
						),
						1351900 => array (
								'province' => '漢堡' 
						),
						1352100 => array (
								'province' => '漢諾威' 
						),
						1351200 => array (
								'province' => '德累斯頓' 
						),
						1351400 => array (
								'province' => '德紹' 
						),
						1352800 => array (
								'province' => '蘭茨胡特' 
						) 
				) 
		),
		2230000 => array (
				'country' => '薩摩亞' 
		),
		1790000 => array (
				'country' => '盧旺達' 
		),
		1760000 => array (
				'country' => '盧森堡' 
		),
		2680000 => array (
				'country' => '澤西島' 
		),
		1560000 => array (
				'country' => '韓國',
				'provinces' => array (
						1560200 => array (
								'province' => '大田' 
						),
						1560100 => array (
								'province' => '大邱',
								'citys' => array (
										1560102 => '大邱',
										1560101 => '達城郡',
										1560103 => '壽城區' 
								) 
						),
						1561200 => array (
								'province' => '仁川' 
						),
						1560500 => array (
								'province' => '江原道',
								'citys' => array (
										1560513 => '三陟市',
										1560514 => '太白市',
										1560511 => '平昌郡',
										1560507 => '江陵市',
										1560512 => '束草市',
										1560502 => '東海市',
										1560504 => '洪川郡',
										1560501 => '春川市',
										1560503 => '高城郡',
										1560518 => '原州市',
										1560506 => '華川郡',
										1560508 => '旌善郡',
										1560517 => '楊口郡',
										1560510 => '寧越郡',
										1560505 => '橫城郡',
										1560516 => '襄陽郡',
										1560515 => '鐵原郡',
										1560509 => '麟蹄郡' 
								) 
						),
						1560400 => array (
								'province' => '光州' 
						),
						1560800 => array (
								'province' => '全羅北道',
								'citys' => array (
										1560806 => '井邑市',
										1560810 => '全州市',
										1560811 => '任實郡',
										1560803 => '扶安郡',
										1560812 => '完州郡',
										1560802 => '長水郡',
										1560805 => '金堤市',
										1560807 => '茂朱郡',
										1560808 => '南原市',
										1560813 => '益山市',
										1560804 => '高敞郡',
										1560801 => '淳昌郡',
										1560809 => '群山市',
										1560814 => '鎭安郡' 
								) 
						),
						1560900 => array (
								'province' => '全羅南道',
								'citys' => array (
										1560915 => '木浦市',
										1560907 => '光陽市',
										1560916 => '求禮郡',
										1560909 => '和順郡',
										1560902 => '長城郡',
										1560903 => '長興郡',
										1560921 => '咸平郡',
										1560922 => '珍島郡',
										1560908 => '海南郡',
										1560906 => '高興郡',
										1560919 => '務安郡',
										1560905 => '莞島郡',
										1560910 => '康津郡',
										1560917 => '順天市',
										1560920 => '新安郡',
										1560904 => '穀城郡',
										1560918 => '潭陽郡',
										1560912 => '麗水市',
										1560914 => '羅州市',
										1560901 => '寶城郡',
										1560911 => '靈光郡',
										1560913 => '靈岩郡' 
								) 
						),
						1561500 => array (
								'province' => '忠清北道',
								'citys' => array (
										1561503 => '丹陽郡',
										1561508 => '永同郡',
										1561505 => '沃川郡',
										1561512 => '忠州市',
										1561506 => '陰城郡',
										1561511 => '淸州市',
										1561507 => '淸原郡',
										1561502 => '堤川市',
										1561501 => '報恩郡',
										1561510 => '曾坪郡',
										1561504 => '槐山郡',
										1561509 => '鎭川郡' 
								) 
						),
						1561600 => array (
								'province' => '忠清南道',
								'citys' => array (
										1561613 => '天安市',
										1561603 => '公州市',
										1561616 => '牙山市',
										1561602 => '扶餘郡',
										1561609 => '青陽郡',
										1561604 => '洪城郡',
										1561601 => '保寧市',
										1561612 => '泰安郡',
										1561614 => '唐津郡',
										1561611 => '舒川郡',
										1561610 => '瑞山市',
										1561608 => '論山市',
										1561615 => '燕岐郡',
										1561606 => '錦山郡',
										1561607 => '禮山郡',
										1561605 => '雞龍市' 
								) 
						),
						1561300 => array (
								'province' => '首爾' 
						),
						1560300 => array (
								'province' => '釜山' 
						),
						1561400 => array (
								'province' => '蔚山' 
						),
						1561000 => array (
								'province' => '廣尚北道',
								'citys' => array (
										1561020 => '永川市',
										1561001 => '安東市',
										1561015 => '尙州市',
										1561003 => '奉化郡',
										1561006 => '金泉市',
										1561023 => '英陽郡',
										1561014 => '靑松郡',
										1561018 => '星州郡',
										1561021 => '盈德郡',
										1561007 => '軍威郡',
										1561009 => '浦項市',
										1561004 => '高靈郡',
										1561002 => '淸道郡',
										1561019 => '義城郡',
										1561016 => '聞慶市',
										1561017 => '蔚珍郡',
										1561013 => '榮州市',
										1561010 => '漆穀郡',
										1561011 => '慶山市',
										1561012 => '慶州市',
										1561005 => '龜尾市',
										1561008 => '醴泉郡',
										1561022 => '鬱陵郡' 
								) 
						),
						1561100 => array (
								'province' => '廣尚南道',
								'citys' => array (
										1561114 => '山淸郡',
										1561107 => '巨濟市',
										1561105 => '居昌郡',
										1561104 => '河東郡',
										1561113 => '泗川市',
										1561106 => '金海市',
										1561102 => '昌原市',
										1561101 => '昌寧郡',
										1561103 => '固城郡',
										1561119 => '宜寧郡',
										1561116 => '咸安郡',
										1561118 => '咸陽郡',
										1561117 => '陜川郡',
										1561112 => '南海郡',
										1561110 => '馬山市',
										1561108 => '晉州市',
										1561109 => '梁山市',
										1561111 => '密陽市',
										1561115 => '統營市',
										1561120 => '鎭海市' 
								) 
						),
						1560600 => array (
								'province' => '濟州島',
								'citys' => array (
										1560614 => '九裏市',
										1560626 => '水原市',
										1560624 => '平澤市',
										1560615 => '加平郡',
										1560609 => '光明市',
										1560602 => '安山市',
										1560601 => '安城市',
										1560603 => '安養市',
										1560619 => '利川市',
										1560613 => '河南市',
										1560625 => '始興市',
										1560617 => '金浦市',
										1560604 => '抱川市',
										1560623 => '坡州市',
										1560606 => '東豆川市',
										1560608 => '果川市',
										1560616 => '軍浦市',
										1560622 => '南楊州市',
										1560605 => '城南市',
										1560627 => '烏山市',
										1560610 => '高陽市',
										1560612 => '華城市',
										1560607 => '富川市',
										1560628 => '揚平郡',
										1560631 => '楊州市',
										1560618 => '漣川郡',
										1560611 => '廣州市',
										1560629 => '儀旺市',
										1560620 => '龍仁市',
										1560630 => '議政府',
										1560621 => '驪州郡' 
								) 
						),
						1560700 => array (
								'province' => '濟州特別自治道' 
						) 
				) 
		),
		1470000 => array (
				'country' => '關島' 
		),
		2130000 => array (
				'country' => '蘇丹' 
		),
		2200000 => array (
				'country' => '蘇裡南' 
		),
		1740000 => array (
				'country' => '羅馬尼亞' 
		) 
);